Repository: 12Me21/mtPaint
Catalog: po/*.po
Languages: cs

source: mtPaint was written by Mark Tyler marktyler_5@hotmail.com http://mtpaint.sourceforge.net/ mtPaint was only possible after I used and studied an excellent program called mhWaveEdit by Magnus Hjorth. As a respectful tribute to this mtPaint uses a slightly modified version of inifile.c/h from mhWaveEdit 1.3.0. Several people have helped me with the mtPaint project, so I would like to thank them all (in alphabetical order): Abdulla Al Muhairi - Website redesign April 2005 Alan Horkan - Feedback/ideas Alexandre Prokoudine - Feedback/ideas Antonio Andrea Bianco - Feedback/ideas Dennis Lee - Wrote the two quantizing methods DL1 & 3 - see quantizer.c for more information Dmitry Groshev - Wrote the code for tint mode and image scaling Ed Jason - Feedback/ideas Guadalinex Team (Junta de Andalucia) - Feedback/ideas, man page, Launchpad/Rosetta registration Lou Afonso - Feedback/ideas Magnus Hjorth - Feedback/ideas Martin Zelaia - Feedback/ideas Pavel Ruzicka - Feedback/ideas Puppy Linux (Barry Kauler) - Feedback/ideas Vlastimil Krejcir - Feedback/ideas William Kern - Feedback/ideas Xiaolin Wu - Wrote the Wu quantizing method - see wu.c for more information Translations have been provided for certain languages by the following people: Brazilian Portuguese - Paulo Trevizan Czech - Pavel Ruzicka French - Nicolas Velin, Pascal Billard Portuguese - Israel G. Lugo Spanish - Guadalinex Team (Junta de Andalucia) Animated GIF file support is provided by Gifsicle which was written by Eddie Kohler - http://www.lcdf.org/gifsicle/
cs: mtPaint naprogramoval Mark Tyler marktyler_5@hotmail.com http://mtpaint.sourceforge.net/ mtPaint mohl vzniknout jen potom co jsem pou¾il a studoval skvìlý program nazvaný mhWaveEdit od Magnuse Hjortha. Na poèest toho mtPaint pou¾ívá lehce modifikovanou verzi inifile.c/h z mhWaveEdit 1.3.0. Mnoho jiných lidí mi také pomohlo s projektem mtPaint, tak¾e bych jim chtìl v¹em podìkovat (v abecedním poøadí): Abdulla Al Muhairi - Redesign stránek - Duben 2005 Alan Horkan - Odezva/nápady Alexandre Prokoudine - Odezva/nápady Antonio Andrea Bianco - Odezva/nápady Dennis Lee - napsal dvì kvantovací metody DL1 & 3 - Pro více informací se podívejte do quantizer.c Dmitry Groshev - Napsal kód re¾imu kolorování a zmìny velikosti obrázku Ed Jason - Odezva/nápady Guadalinex Team (Junta de Andalucia) - Odezva/nápady, manuálová stránka, Launchpad/Rosetta registrace Lou Afonso - Odezva/nápady Magnus Hjorth - Odezva/nápady Martin Zelaia - Odezva/nápady Pavel Ruzicka - Odezva/nápady Puppy Linux (Barry Kauler) - Odezva/nápady Vlastimil Krejcir - Odezva/nápady William Kern - Odezva/nápady Xiaolin Wu - Napsal Wu quantovací metodu - více informací v souboru wu.c Pøeklady do jednotlivých jazykù byly poskytnuty následujícími lidmi: Brazilská Portugal¹tina - Paulo Trevizan Èe¹tina - Pavel Ruzicka Francou¾¹tina - Nicolas Velin, Pascal Billard Portugal¹tina - Israel G. Lugo ©panìl¹tina - Guadalinex Team (Junta de Andalucia) Podpora animovaných GIFù vyu¾ívá program Gifsicle, který naprogramoval Eddie Kohler - http://www.lcdf.org/gifsicle/

source: Information
cs: Informace

source: Memory
cs: Pamì»

source: Total memory for main + undo images
cs: Celková pamì» pro hlavní obrázky a historii

source: Undo / Redo / Max levels used
cs: Zpìt / Vpøed / Max poèet úrovní

source: Clipboard
cs: Schránka

source: Unused
cs: Nepou¾ito

source: Clipboard = %i x %i
cs: Schránka = %i x %i

source: Clipboard = %i x %i x RGB
cs: Schránka = %i x %i x RGB

source: Unique RGB pixels
cs: Unikátních RGB pixelù

source: Total layer memory usage
cs: Spotøeba pamìti v¹ech vrstev

source: Colour Histogram
cs: Histogram barev

source: Normalize
cs: Normalizovat

source: Colour index totals - %i of %i used
cs: Barevný index celkovì - pou¾ito %i z %i

source: Canvas pixels
cs: Pixelù na plátnì

source: Orphans
cs: Sirotkù

source: Could not open %s: %s
cs: Nelze otevøít %s: %s

source: Error closing %s: %s
cs: Chyba zavøení %s: %s

source: Could not write to %s: %s
cs: Nelze zapsat do %s: %s

source: Could not find home directory. Using current directory as home directory.
cs: Nelze nalézt domovský adresáø. Pou¾iji aktuální adresáø jako domovský.

source: Background
cs: Pozadí

source: (Modified)
cs: (Zmìnìno)

source: Do you really want to delete layer %i (%s) ?
cs: Opravdu chcete smazat vrstvu %i (%s) ?

source: One or more of the layers contains changes that have not been saved. Do you really want to lose these changes?
cs: Jedna, nebo více vrstev obsahuje zmìny, které nebyly ulo¾eny. Opravdu je chcete ztratit?

source: Cancel Operation
cs: Storno

source: Lose Changes
cs: Budi¾

source: One or more of the image layers has not been saved. You must save each image individually before saving the layers text file in order to load this composite image in the future.
cs: Jedna, nebo více vrstev nebyla ulo¾ena. Musíte ulo¾it ka¾dý obrázek zvlá¹»,ne¾ ulo¾íte textový soubor s vrstvami, abyste mohli v budoucnosti otevøít tento kompozitní obrázek.

source: Do you really want to delete all of the layers?
cs: Opravdu chcete smazat v¹echny vrstvy?

source: You cannot add any more layers.
cs: Nemù¾ete ji¾ pøidat ¾ádné dal¹í vrstvy.

source: Layer Name
cs: Název vrstvy

source: Position
cs: Pozice

source: Opacity
cs: Neprùsvitnost

source: Transparent Colour
cs: Prùhledná barva

source: Show all layers in main window
cs: Zobrazit v¹echny vrstvy v hlavním oknì

source: There were no unused colours to remove!
cs: Nejsou ¾ádné nepou¾ité barvy na odstranìní!

source: The palette does not contain enough colours to do a merge
cs: Paleta neobsahuje dostatek barev pro provedení slouèení

source: The palette does not contain 2 colours that have identical RGB values
cs: Paleta neobsahuje ¾ádné barvy s identickými RGB hodnotami

source: There are too many identical palette items to be reduced.
cs: Pøíli¹ mnoho identických polo¾ek palety k redukci.

source: The palette contains %i colours that have identical RGB values. Do you really want to merge them into one index and realign the canvas?
cs: Paleta obsahuje %i barev se stejnými RGB hodnotami. Opravdu je chcete slouèit do jedné a upravit plátno?

source: patterns_user.c could not be opened in current directory
cs: patterns_user.c nelze otevøít v aktuálním adresáøi

source: Done
cs: Hotovo

source: patterns_user.c created in current directory
cs: patterns_user.c vytvoøeno v aktuálním adresáøi

source: Current image is not 94x94x3 so I cannot create patterns_user.c
cs: Aktuální obrázek není 94x94x3, tak¾e nelze vytvoøit patterns_user.c

source: You must have 16 or fewer palette colours to export ASCII art.
cs: Pokud chcete exportovat ASCII kresbu, musíte mít maximálnì 16 barev.

source: You must save at least one frame to create an animated GIF.
cs: Abyste vytvoøili animovaný GIF, musíte ulo¾it alespoò jeden snímek.

source: You are trying to save an RGB image to an XPM file which is not possible. I would suggest you save with a PNG extension.
cs: Pokou¹íte se ulo¾it RGB obrázek do XPM souboru, co¾ není mo¾né. Doporuèuji ulo¾it s pøíponou PNG.

source: You are trying to save an RGB image to a GIF file which is not possible. I would suggest you save with a PNG extension.
cs: Pokou¹íte se ulo¾it RGB obrázek do GIF souboru, co¾ není mo¾né. Doporuèuji ulo¾it s pøíponou PNG.

source: You are trying to save an XBM file with a palette of more than 2 colours. Either use another format or reduce the palette to 2 colours.
cs: Pokou¹íte se ulo¾it XBM soubor s paletou s více ne¾ 2 barvami. Pou¾ijte jiný formát, nebo sni¾te poèet barev v paletì na 2.

source: You are trying to save an indexed canvas to a JPEG file which is not possible. I would suggest you save with a PNG extension.
cs: Pokou¹íte se ulo¾it indexované plátno do JPEG souboru, co¾ není mo¾né. Doporuèuji ulo¾it s pøíponou PNG.

source: You are trying to save an indexed canvas to a TIFF file which is not possible. I would suggest you save with a PNG extension.
cs: Pokou¹íte se ulo¾it indexované plátno do TIFF souboru, co¾ není mo¾né. Doporuèuji ulo¾it s pøíponou PNG.

source: Unable to load clipboard
cs: Nelze naèíst schránku

source: Unable to save clipboard
cs: Nelze ulo¾it schránku

source: This canvas/palette contains changes that have not been saved. Do you really want to lose these changes?
cs: Plátno / paleta obsahuje neulo¾ené zmìny. Opravdu je chcete ztratit?

source: Do you really want to quit?
cs: Opravdu chcete skonèit?

source: New Layer
cs: Nová vrstva

source: Raise
cs: Nahoru

source: Lower
cs: Dolù

source: Duplicate Layer
cs: Zduplikovat vrstvu

source: Centralise Layer
cs: Vycentrovat vrstvu

source: Delete Layer
cs: Smazat vrstvu

source: Save Layer Information & Composite Image
cs: Ulo¾it informace o vrstvách a kompozitní obrázek

source: Save As ...
cs: Ulo¾it jako...

source: Delete All Layers
cs: Smazat v¹echny vrstvy

source: Close Layers Window
cs: Zavøít okno vrstev

source: New Image
cs: Nový obrázek

source: Cut
cs: Vyjmout

source: Copy
cs: Kopírovat

source: Paste
cs: Vlo¾it

source: Undo
cs: Zpìt

source: Redo
cs: Vpøed

source: Ellipse Outline
cs: Prázdná elipsa

source: Filled Ellipse
cs: Vyplnìná elipsa

source: Outline Selection
cs: Orámovat výbìr

source: Fill Selection
cs: Vyplnit výbìr

source: Flip Selection Vertically
cs: Otoèit výbìr vertikálnì

source: Flip Selection Horizontally
cs: Otoèit výbìr horizontálnì

source: Rotate Selection Clockwise
cs: Otoèit výbìr po smìru ruèièek

source: Rotate Selection Anti-Clockwise
cs: Otoèit výbìr proti smìru ruèièek

source: Choose Brush
cs: Výbìr ¹tìtce

source: Paint
cs: Malování

source: Shuffle
cs: Pøeházení

source: Flood Fill
cs: Vyplnìní

source: Straight Line
cs: Rovná èára

source: Smudge
cs: Rozmazat

source: Clone
cs: Klonovat

source: Make Selection
cs: Oznaèit výbìr

source: Polygon Selection
cs: Výbìr polygonem

source: Lasso Selection
cs: Výbìr lasem

source: Crop
cs: Oøíznout

source: Paste Text
cs: Vlo¾it text

source: Transform Colour
cs: Transformace barev

source: Edit All Colours
cs: Editor v¹ech barev

source: Pan Window
cs: Pøehledové okno

source: /_File
cs: /_Soubor

source: /File/tear
cs: /Soubor/okraj

source: /File/New
cs: /Soubor/Nový

source: /File/Open ...
cs: /Soubor/Otevøít ...

source: /File/Save
cs: /Soubor/Ulo¾it

source: /File/Save As ...
cs: /Soubor/Ulo¾it jako ...

source: /File/sep1
cs: /Soubor/sep1

source: /File/Export Undo Images ...
cs: /Soubor/Export obrázkù historie...

source: /File/Export Undo Images (reversed) ...
cs: /Soubor/Export obrázkù historie (reverznì) ...

source: /File/Export ASCII Art ...
cs: /Soubor/Exportovat jako ASCII kresbu ...

source: /File/Export Animated GIF ...
cs: /Soubor/Exportovat jako animovaný GIF ...

source: /File/sep2
cs: /Soubor/sep2

source: /File/1
cs: /Soubor/1

source: /File/2
cs: /Soubor/2

source: /File/3
cs: /Soubor/3

source: /File/4
cs: /Soubor/4

source: /File/5
cs: /Soubor/5

source: /File/6
cs: /Soubor/6

source: /File/7
cs: /Soubor/7

source: /File/8
cs: /Soubor/8

source: /File/9
cs: /Soubor/9

source: /File/10
cs: /Soubor/10

source: /File/11
cs: /Soubor/11

source: /File/12
cs: /Soubor/12

source: /File/13
cs: /Soubor/13

source: /File/14
cs: /Soubor/14

source: /File/15
cs: /Soubor/15

source: /File/16
cs: /Soubor/16

source: /File/17
cs: /Soubor/17

source: /File/18
cs: /Soubor/18

source: /File/19
cs: /Soubor/19

source: /File/20
cs: /Soubor/20

source: /File/Quit
cs: /Soubor/Konec

source: /_Edit
cs: /_Upravit

source: /Edit/tear
cs: /Upravit/okraj

source: /Edit/Undo
cs: /Upravit/Zpìt

source: /Edit/Redo
cs: /Upravit/Vpøed

source: /Edit/sep1
cs: /Upravit/sep1

source: /Edit/Cut
cs: /Upravit/Vyjmout

source: /Edit/Copy
cs: /Upravit/Kopírovat

source: /Edit/Paste To Centre
cs: /Upravit/Vlo¾it doprostøed

source: /Edit/Paste To New Layer
cs: /Upravit/Vlo¾it do nové vrstvy

source: /Edit/Paste
cs: /Upravit/Vlo¾it

source: /Edit/Paste Text
cs: /Upravit/Vlo¾it text

source: /Edit/Load Clipboard
cs: /Upravit/Naèíst schránku

source: /Edit/Load Clipboard/tear
cs: /Upravit/Naèíst schránku/okraj

source: /Edit/Load Clipboard/1
cs: /Upravit/Naèíst schránku/1

source: /Edit/Load Clipboard/2
cs: /Upravit/Naèíst schránku/2

source: /Edit/Load Clipboard/3
cs: /Upravit/Naèíst schránku/3

source: /Edit/Load Clipboard/4
cs: /Upravit/Naèíst schránku/4

source: /Edit/Load Clipboard/5
cs: /Upravit/Naèíst schránku/5

source: /Edit/Load Clipboard/6
cs: /Upravit/Naèíst schránku/6

source: /Edit/Load Clipboard/7
cs: /Upravit/Naèíst schránku/7

source: /Edit/Load Clipboard/8
cs: /Upravit/Naèíst schránku/8

source: /Edit/Load Clipboard/9
cs: /Upravit/Naèíst schránku/9

source: /Edit/Load Clipboard/10
cs: /Upravit/Naèíst schránku/10

source: /Edit/Load Clipboard/11
cs: /Upravit/Naèíst schránku/11

source: /Edit/Load Clipboard/12
cs: /Upravit/Naèíst schránku/12

source: /Edit/Save Clipboard
cs: /Upravit/Ulo¾it schránku

source: /Edit/Save Clipboard/tear
cs: /Upravit/Ulo¾it schránku/okraj

source: /Edit/Save Clipboard/1
cs: /Upravit/Ulo¾it schránku/1

source: /Edit/Save Clipboard/2
cs: /Upravit/Ulo¾it schránku/2

source: /Edit/Save Clipboard/3
cs: /Upravit/Ulo¾it schránku/3

source: /Edit/Save Clipboard/4
cs: /Upravit/Ulo¾it schránku/4

source: /Edit/Save Clipboard/5
cs: /Upravit/Ulo¾it schránku/5

source: /Edit/Save Clipboard/6
cs: /Upravit/Ulo¾it schránku/6

source: /Edit/Save Clipboard/7
cs: /Upravit/Ulo¾it schránku/7

source: /Edit/Save Clipboard/8
cs: /Upravit/Ulo¾it schránku/8

source: /Edit/Save Clipboard/9
cs: /Upravit/Ulo¾it schránku/9

source: /Edit/Save Clipboard/10
cs: /Upravit/Ulo¾it schránku/10

source: /Edit/Save Clipboard/11
cs: /Upravit/Ulo¾it schránku/11

source: /Edit/Save Clipboard/12
cs: /Upravit/Ulo¾it schránku/12

source: /Edit/Choose Pattern ...
cs: /Upravit/Vybrat vzor ...

source: /Edit/Choose Brush ...
cs: /Upravit/Vybrat ¹tìtec ...

source: /Edit/Create Patterns
cs: /Upravit/Vytvoøit vzory

source: /Edit/Continuous Painting
cs: /Upravit/Spojité malování

source: /Edit/Opacity Undo Mode
cs: /Upravit/Neprùsvitný re¾im historie

source: /Edit/Tint Mode
cs: /Upravit/Re¾im kolorování

source: /Edit/Tint +-
cs: /Upravit/Kolorování +-

source: /_View
cs: /_Zobrazit

source: /View/tear
cs: /Zobrazit/okraj

source: /View/Set Zoom ...
cs: /Zobrazit/Nastavit Zoom ...

source: /View/10%
cs: /Zobrazit/10%

source: /View/25%
cs: /Zobrazit/25%

source: /View/50%
cs: /Zobrazit/50%

source: /View/100%
cs: /Zobrazit/100%

source: /View/400%
cs: /Zobrazit/400%

source: /View/800%
cs: /Zobrazit/800%

source: /View/1200%
cs: /Zobrazit/1200%

source: /View/1600%
cs: /Zobrazit/1600%

source: /View/2000%
cs: /Zobrazit/2000%

source: /View/sep1
cs: /Zobrazit/sep1

source: /View/Zoom in (+)
cs: /Zobrazit/Pøiblí¾it (+)

source: /View/Zoom out (-)
cs: /Zobrazit/Vzdálit (-)

source: /View/Show zoom grid
cs: /Zobrazit/Rastr pøi zvìt¹ení

source: /View/Toggle Image View (Home)
cs: /Zobrazit/Pøepnout zobrazení (Home)

source: /View/Pan Window (End)
cs: /Zobrazit/Pøehledové okno (End)

source: /View/Command Line Window
cs: /Zobrazit/Okno pøíkazového øádku

source: /View/View Window
cs: /Zobrazit/Okno zobrazení

source: /View/Layers Window
cs: /Zobrazit/Okno vrstev

source: /_Image
cs: /_Obrázek

source: /Image/tear
cs: /Obrázek/okraj

source: /Image/Convert To RGB
cs: /Obrázek/Pøevést na RGB

source: /Image/Convert To Indexed
cs: /Obrázek/Pøevést na indexovaný

source: /Image/sep1
cs: /Obrázek/sep1

source: /Image/Scale Canvas ...
cs: /Obrázek/Zmìnit mìøítko plátna ...

source: /Image/Resize Canvas ...
cs: /Obrázek/Zmìnit velikost plátna ...

source: /Image/Crop
cs: /Obrázek/Oøíznout

source: /Image/Flip Vertically
cs: /Obrázek/Otoèit vertikálnì

source: /Image/Flip Horizontally
cs: /Obrázek/Otoèit horizontálnì

source: /Image/Rotate Clockwise
cs: /Obrázek/Otoèit po smìru ruèièek

source: /Image/Rotate Anti-Clockwise
cs: /Obrázek/Otoèit proti smìru ruèièek

source: /Image/Free Rotate ...
cs: /Obrázek/Otoèit libovolnì ...

source: /Image/Information ...
cs: /Obrázek/Informace ...

source: /Image/Preferences ...
cs: /Obrázek/Volby ...

source: /_Selection
cs: /_Výbìr

source: /Selection/tear
cs: /Výbìr/okraj

source: /Selection/Select All
cs: /Výbìr/Vybrat v¹e

source: /Selection/Select None (Esc)
cs: /Výbìr/Zru¹it výbìr (Esc)

source: /Selection/Lasso Selection
cs: /Výbìr/Výbìr lasem

source: /Selection/Lasso Selection Cut
cs: /Výbìr/Vyjmout lasem

source: /Selection/sep1
cs: /Výbìr/sep1

source: /Selection/Outline Selection
cs: /Výbìr/Orámovat výbìr

source: /Selection/Fill Selection
cs: /Výbìr/Vyplnit výbìr

source: /Selection/Outline Ellipse
cs: /Výbìr/Orámovat elipsu

source: /Selection/Fill Ellipse
cs: /Výbìr/Vyplnit elipsu

source: /Selection/Flip Vertically
cs: /Výbìr/Otoèit vertikálnì

source: /Selection/Flip Horizontally
cs: /Výbìr/Otoèit horizontálnì

source: /Selection/Rotate Clockwise
cs: /Výbìr/Otoèit po smìru ruèièek

source: /Selection/Rotate Anti-Clockwise
cs: /Výbìr/Otoèit proti smìru ruèièek

source: /Selection/Alpha Blend A,B
cs: /Výbìr/Alfa pøechod mezi A,B

source: /Selection/Mask Colour A,B
cs: /Výbìr/Maskovat barvy A,B

source: /Selection/Unmask Colour A,B
cs: /Výbìr/Odmaskovat barvy A,B

source: /Selection/Mask All Colours
cs: /Výbìr/Maskovat v¹echny barvy

source: /Selection/Clear Mask
cs: /Výbìr/Zru¹it masku

source: /_Palette
cs: /_Paleta

source: /Palette/tear
cs: /Paleta/okraj

source: /Palette/Open ...
cs: /Paleta/Otevøít ...

source: /Palette/Save As ...
cs: /Paleta/Ulo¾it jako ...

source: /Palette/Create Scale A->B
cs: /Paleta/Vytvoøit ¹kálu A->B

source: /Palette/Load Default
cs: /Paleta/Naèíst výchozí

source: /Palette/sep1
cs: /Paleta/sep1

source: /Palette/Mask All
cs: /Paleta/Maskovat v¹echny barvy

source: /Palette/Mask None
cs: /Paleta/Nemaskovat ¾ádnou barvu

source: /Palette/Swap A & B
cs: /Paleta/Prohodit A a B

source: /Palette/Edit Colour A & B ...
cs: /Paleta/Upravit barvy A a B ...

source: /Palette/Edit All Colours ...
cs: /Paleta/Upravit v¹echny barvy ...

source: /Palette/Set Palette Size ...
cs: /Paleta/Nastavit poèet barev ...

source: /Palette/Merge Duplicate Colours
cs: /Paleta/Slouèit duplicitní barvy

source: /Palette/Remove Unused Colours
cs: /Paleta/Odstranit nepou¾ité barvy

source: /Palette/Create Quantized (DL1)
cs: /Paleta/Vytvoøit kvantované (DL1)

source: /Palette/Create Quantized (DL3)
cs: /Paleta/Vytvoøit kvantované (DL3)

source: /Palette/Create Quantized (Wu)
cs: /Paleta/Vytvoøit kvantované (Wu)

source: /Palette/Sort Colours ...
cs: /Paleta/Uspoøádat barvy ...

source: /_Opacity
cs: /_Neprùsvitnost

source: /Opacity/tear
cs: /Neprùsvitnost/okraj

source: /Opacity/10%
cs: /Neprùsvitnost/10%

source: /Opacity/20%
cs: /Neprùsvitnost/20%

source: /Opacity/30%
cs: /Neprùsvitnost/30%

source: /Opacity/40%
cs: /Neprùsvitnost/40%

source: /Opacity/50%
cs: /Neprùsvitnost/50%

source: /Opacity/60%
cs: /Neprùsvitnost/60%

source: /Opacity/70%
cs: /Neprùsvitnost/70%

source: /Opacity/80%
cs: /Neprùsvitnost/80%

source: /Opacity/90%
cs: /Neprùsvitnost/90%

source: /Opacity/100%
cs: /Neprùsvitnost/100%

source: /Opacity/sep1
cs: /Neprùsvitnost/sep1

source: /Opacity/-1% Ctrl+ -
cs: /Neprùsvitnost/-1% Ctrl+ -

source: /Opacity/+1% Ctrl+ +
cs: /Neprùsvitnost/+1% Ctrl+ +

source: /Effe_cts
cs: /_Efekty

source: /Effects/tear
cs: /Efekty/okraj

source: /Effects/Transform Colour ...
cs: /Efekty/Transformovat barvy ...

source: /Effects/Invert
cs: /Efekty/Invertovat

source: /Effects/Greyscale
cs: /Efekty/©edá ¹kála

source: /Effects/Isometric Transformation
cs: /Efekty/Isometrické transformace

source: /Effects/Isometric Transformation/tear
cs: /Efekty/Isometrické transformace/okraj

source: /Effects/Isometric Transformation/Left Side Down
cs: /Efekty/Isometrické transformace/Levá strana dolù

source: /Effects/Isometric Transformation/Right Side Down
cs: /Efekty/Isometrické transformace/Pravá strana dolù

source: /Effects/Isometric Transformation/Top Side Right
cs: /Efekty/Isometrické transformace/Horní strana vpravo

source: /Effects/Isometric Transformation/Bottom Side Right
cs: /Efekty/Isometrické transformace/Dolní strana vpravo

source: /Effects/sep1
cs: /Efekty/sep1

source: /Effects/Edge Detect
cs: /Efekty/Detekce hran

source: /Effects/Sharpen ...
cs: /Efekty/Zaostøit ...

source: /Effects/Soften ...
cs: /Efekty/Zjemnit ...

source: /Effects/Blur ...
cs: /Efekty/Rozmazat ...

source: /Effects/Emboss
cs: /Efekty/Reliéfy

source: /Effects/Bacteria ...
cs: /Efekty/Baktérie ...

source: /Frames
cs: /Snímky

source: /Frames/tear
cs: /Snímky/okraj

source: /Frames/Configure Animation ...
cs: /Snímky/Konfigurovat animaci ...

source: /Frames/Preview Animation ...
cs: /Snímky/Náhled animace ...

source: /Frames/sep1
cs: /Snímky/sep1

source: /Frames/Set key frame ...
cs: /Snímky/Nastavit klíèový snímek ...

source: /Frames/Remove all key frames ...
cs: /Snímky/Odstranit v¹echny klíèové snímky ...

source: /_Help
cs: /Po_moc

source: /Help/About
cs: /Pomoc/O aplikaci

source: /Opacity
cs: /Neprùsvitnost

source: /File/%i
cs: /Soubor/%i

source: /Opacity/%i0%%
cs: /Neprùsvitnost/%i0%%

source: Size
cs: Velikost

source: Flow
cs: Bohatost

source: Converting to Indexed Palette
cs: Pøevádím na indexovou paletu

source: Converting to Greyscale
cs: Pøevádím do ¹kály ¹edi

source: Inverting Image
cs: Invertuji obrázek

source: Flipping vertically
cs: Otáèím vertikálnì

source: Flipping horizontally
cs: Otáèím horizontálnì

source: Bacteria Effect
cs: Efekt baktérie

source: Rotating
cs: Otáèím

source: Free Rotation
cs: Volné otáèení

source: Scaling Image
cs: Mìním mìøítko obrázku

source: Counting Unique RGB Pixels
cs: Poèítám poèet unikátních RGB pixelù

source: Applying Effect
cs: Aplikuji efekt

source: Please Wait ...
cs: Prosím èekejte ...

source: Greyscale
cs: ©kála ¹edi

source: Indexed Palette
cs: Indexovaná paleta

source: Grab Screenshot
cs: Sejmout obrazovku

source: Width
cs: ©íøka

source: Height
cs: Vý¹ka

source: Colours
cs: Barev

source: Create
cs: Vytvoøit

source: Colour Editor
cs: Editor barev

source: Red
cs: Èervená

source: Green
cs: Zelená

source: Blue
cs: Modrá

source: Posterize
cs: bitù na barvu

source: Pattern Chooser
cs: Výbìr vzoru

source: Set Palette Size
cs: Nastavit poèet barev

source: The image is too large for this rotation.
cs: Obrázek je moc velký pro tuto rotaci.

source: Image Blur Effect
cs: Efekt rozmazání obrázku

source: Blur Effect
cs: Efekt rozmazání

source: Edge Sharpen
cs: Zaostøení hran

source: Edge Soften
cs: Zjemnìní hran

source: Free Rotate
cs: Libovolná rotace

source: Set Key Frame
cs: Nastavit klíèový snímek

source: Smooth
cs: Vyhladit

source: Apply
cs: Provést

source: Hue
cs: Odstín

source: Saturation
cs: Saturace

source: Luminance
cs: Jas

source: Frequency
cs: Frekvence

source: Sort Palette Colours
cs: Seøadit barvy v paletì

source: Start Index
cs: Od indexu

source: End Index
cs: Do indexu

source: Reverse Order
cs: Opaèné øazení

source: Auto-Preview
cs: Automatický náhled

source: Palette
cs: Paleta

source: Image
cs: Obrázek

source: Brightness
cs: Jas

source: Contrast
cs: Kontrast

source: New geometry is the same as now - nothing to do.
cs: Nové rozmìry jsou stejné jako pùvodní - nic se neprovede.

source: The operating system cannot allocate the memory for this operation.
cs: Operaèní systém nemù¾e alokovat pamì» pro tuto operaci.

source: You have not allocated enough memory in the Preferences window for this operation.
cs: Pro tuto operaci jste nealokovali dostatek pamìti v oknì Volby.

source: Nearest Neighbour
cs: Nejbli¾¹í okolí

source: Bilinear / Area Mapping
cs: Bilineární / mapování oblasti

source: Bicubic
cs: Bikubické

source: Bicubic edged
cs: Bikubické s hranami

source: Bicubic better
cs: Lep¹í bikubické

source: Bicubic sharper
cs: Bikubické ostøej¹í

source: Width
cs: ©íøka

source: Height
cs: Vý¹ka

source: Original
cs: Originál

source: New
cs: Nový

source: Offset
cs: Posun

source: Centre
cs: Vycentrovat

source: Fix Aspect Ratio
cs: Dodr¾et pomìr stran
