Repository: 12Me21/mtPaint
Catalog: po/*.po
Languages: cs

source: Animation Preview
cs: Náhled animace

source: Fix
cs: Fixovat

source: Close
cs: Zavøít

source: Error
cs: Chyba

source: Unable to create output directory
cs: Nelze vytvoøit výstupní adresáø

source: Unable to save image
cs: Nelze ulo¾it obrázek

source: Warning
cs: Varování

source: Do you really want to clear all of the position and cycle data for all of the layers?
cs: Opravdu chcete vymazat v¹echna pozièní a cyklová data pro v¹echny vrstvy?

source: No
cs: Ne

source: Yes
cs: Ano

source: You must have at least 2 layers to create an animation
cs: Musíte mít alespoò 2 vrstvy pro vytvoøení animace

source: Untitled
cs: Bez_jmena

source: You must save your layers file before creating an animation
cs: Pøed vytvoøením animace musíte nejprve ulo¾it soubor vrstev

source: Configure Animation
cs: Konfigurovat animaci

source: Output Files
cs: Výstupní soubory

source: Start frame
cs: První snímek

source: End frame
cs: Poslední snímek

source: Delay
cs: Zpo¾dìní

source: Output path
cs: Výstupní cesta

source: File prefix
cs: Pøedpona souboru

source: Create GIF frames
cs: Vytvoøit snímky GIF

source: Progress
cs: Postup

source: Layers
cs: Vrstvy

source: Positions
cs: Pozice

source: Cycling
cs: Cyklus

source: Save
cs: Ulo¾it

source: Preview
cs: Náhled

source: Create Frames
cs: Vytvoøit snímky

source: Error %i reported when trying to run %s
cs: Nastala chyba %i pøi pokusu o spu¹tìní %s

source: The image is too large to transform.
cs: Obrázek je pro transformaci pøíli¹ velký.

source: Not enough memory to rotate image
cs: Nedostatek pamìti pro rotaci obrázku

source: Not enough memory to rotate clipboard
cs: Nedostatek pamìti pro rotaci schránky

source: Not enough memory to create clipboard
cs: Nedostatek pamìti pro vytvoøení schránky

source: Image is not indexed: %s
cs: Obrázek není indexovaný: %s

source: File is too big, must be <= to width=%i height=%i : %s
cs: Soubor je pøíli¹ velký, musí být <= ¹íøka=%i vý¹ka=%i : %s

source: Unable to load file
cs: Nelze naèíst soubor

source: The file import library had to terminate due to a problem with the file (possibly corrupt image data or a truncated file). I have managed to load some data as the header seemed fine, but I would suggest you save this image to a new file to ensure this does not happen again.
cs: Knihovna pro import souborù skonèila z dùvodu problémù se souborem (mo¾ná po¹kozená obrazová data, nebo zkrácený soubor) Podaøilo se naèíst nìjaká data jako hlavièku snad v poøádku, ale doporuèuji ulo¾it tento obrázek do nového souboru, aby se situace ji¾ neopakovala.

source: This is an animated GIF file. What do you want to do?
cs: Toto je animovaný GIF. Co s ním chcete udìlat?

source: Cancel
cs: Storno

source: Edit Frames
cs: Upravit snímky

source: View Animation
cs: Zobrazit animaci

source: File: %s already exists. Do you want to overwrite it?
cs: Soubor: %s ji¾ existuje. Chcete ho pøepsat?

source: File Found
cs: Soubor nalezen

source: NO
cs: NE

source: YES
cs: ANO

source: File: %s invalid - palette not updated
cs: Soubor: %s je neplatný - paleta nebyla aktualizována

source: Unable to save file: %s
cs: Nelze ulo¾it soubor: %s

source: Unable to export undo images
cs: Nelze exportovat obrázky historie

source: Unable to export ASCII file
cs: Nelze exportovat do ASCII souboru

source: Load Image File
cs: Naètení obrázku

source: Save Image File
cs: Ulo¾ení obrázku

source: Load Palette File
cs: Naètení palety

source: Save Palette File
cs: Ulo¾ení palety

source: Select Clipboard File
cs: Výbìr souboru schránky

source: Export Undo Images
cs: Export obrázkù historie

source: Export Undo Images (reversed)
cs: Export obrázkù historie (reverznì)

source: Export ASCII Art
cs: Exportovat jako ASCII kresbu

source: Save Layer Files
cs: Ulo¾ení souborù vrstev

source: Import GIF animation - Choose frames directory
cs: Importovat GIF animaci - Vyberte adresáø snímkù

source: Export GIF animation
cs: Exportovat GIF animaci

source: Animation delay
cs: Zpo¾dìní animace

source: File Format
cs: Typ souboru

source: Set transparency index
cs: Nastavení indexu prùhlednosti

source: JPEG Save Quality (100=High)
cs: Kvalita ukládání JPEGu (100=Vysoká)

source: Set hotspot
cs: Nastavení aktivního bodu

source: General
cs: Obecné

source: File Formats
cs: Typy souborù

source: The Palette
cs: Paleta

source: Patterns
cs: Vzory

source: Tools
cs: Nástroje

source: Selections
cs: Výbìry

source: The Clipboard
cs: Schránka

source: Animation
cs: Animace

source: Keyboard shortcuts
cs: Klávesové zkratky

source: Mouse shortcuts
cs: Zkratky my¹i

source: Limitations
cs: Omezení

source: Tips
cs: Tipy

source: Credits
cs: Podìkování

source: mtPaint 2.30 - Copyright (C) 2004-2006 Mark Tyler mtPaint is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. mtPaint is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. mtPaint is a simple GTK+1/2 painting program designed for creating icons and pixel based artwork. It can edit indexed palette or 24 bit RGB images and offers basic painting and palette manipulation tools. Its main file format is PNG, although it can also handle JPEG, GIF, TIFF, BMP, XPM, and XBM files. Due to its simplicity and lack of dependencies it runs well on GNU/Linux, Windows and older PC hardware. If you find a bug feel free to contact me about this so I can try to help - the address is in the section "Credits". Before you send me any reports I would suggest you read the section "Limitations" as there are some issues that I have not been able to resolve. If you are a developer and you have improved any part of mtPaint, please let me know what you have done so I can share this with other mtPaint users.
cs: mtPaint 2.30 - Copyright (C) 2004-2006 Mark Tyler mtPaint je svobodný software; mù¾ete ho ¹íøit a/nebo modifikovat v souladu s GNU General Public Licencí jak byla publikována Free Software Foundation; buï verzí 2, nebo( dle va¹eho zvá¾ení) jakoukoliv dal¹í verzí. mtPaint je distribuován v nadìji, ¾e bude pou¾íván, ale BEZ JAKÉKOLIV ZÁRUKY; a také bez samozøejmé záruky PRODEJNOSTI, nebo SCHOPNOSTI PLNIT SPECIÁLNÍ ÚÈELY. Pro více detailù si pøeètìte GNU General Public Licenci. mtPaint je jednoduchý GTK+1/2 kreslící program navr¾ený pro vytváøení ikon a kreseb tvoøených pixely. Mù¾e upravovat obrázky s indexovanou, nebo 24 bit RGB paletou a nabídnout základní kreslicí a manipulaèní nástroje. Jako hlavní typ souboru pou¾ívá PNG, aèkoliv zvládne také JPEG, GIF, TIFF, BMP, XPM, a XBM soubory. Vzhledem ke své jednoduchosti a bez závislostí bì¾í dobøe na GNU/ Linuxu, Windows a star¹ím PC hardware. Pokud naleznete chybu, nestyïte se mne kontaktovat a já se vám pokusím pomoci - adresa je v sekci "Podìkování". Pøedtím, ne¾ mi po¹lete report, tak vám doporuèuji pøeèíst sekci "Omezení" , proto¾e jsou zde nìkteré vìci, které nejsem schopen vyøe¹it. Pokud jste vývojáø a máte vylep¹enou nìkterou èást mtPaintu, prosím dejte mi vìdìt, co jste udìlal, a já to budu moci dát k dispozici ostatním u¾ivatelùm mtPaintu.

source: mtPaint can handle the following file formats: PNG Load/Save indexed palette and 24 bit RGB with optional transparency index JPEG Load 24 bit RGB & Greyscale. Save 24 bit RGB - Quality set by Preferences window XPM Load/Save indexed palette - Including transparency index via Preferences->Files XBM Load/Save - Including hotspot via Preferences->Files GIF Load/Save single image indexed palette with optional transparency index. If you have Gifsicle installed you can also load and save animated GIF files. TIFF Load/Save 24 bit RGB BMP Load/Save uncompressed 1, 4, 8 bit indexed palette or 24 bit RGB When loading a file, mtPaint will automatically determine what the file format is and load it accordingly. When loading an image file which contains meta data (e.g. image author or comments), mtPaint does not save this data so if this is important to you then you will need to save a new file to avoid losing data that is in the original file. It is possible to save all of the current undo images to a sequence of PNG files. Go to the File menu and select the "Export Undo Images" option. Choose which directory you want to save the files to and then enter the file prefix in the filename box, e.g. "out". The undo files will then be saved to out001.png, out002.png etc. Once you have done this you can have fun animating these images and see how your artwork developed to its final state. The easiest way to do this is to use the ImageMagick command: animate -delay 10 out*.png mtPaint can export an indexed image with 16 or fewer colours to an ASCII Art text file (File -> Export ASCII Art). mtPaint presumes that this is a greyscale image with 16 levels of intensity (0=black), so to convert a 24 bit RGB photo image to ASCII art you could try the following: 1) Reduce the image to a width of about 80 pixels using scale or crop 2) Image -> Greyscale 3) Effects -> Contrast : Ensure that the image has a strong contrast between black and white areas 4) Palette -> Set Palette Size : to 16 5) Set A as colour 0 (black) and B as colour 15 (white) 6) Palette -> Create Scale 7) Image -> Convert To Indexed : using 16 colours and Quantize to palette 8) File -> Export ASCII Art : to ~/a.txt ~/a.txt will then contain an ASCII version of the image that should be viewed in an editor or console with a dark background and light text. If you use a light background with dark text, simply invert the image after step 2).
cs: mtPaint mù¾e pracovat s následujícími typy souborù: PNG Otevøení/Ulo¾ení indexovaná paleta a 24 bit RGB volitelnì s indexem prùhlednosti JPEG Otevøení 24 bit RGB a ¹kála ¹edi. Ulo¾ení 24 bit RGB - Kvalita nastavena v oknì voleb XPM Otevøení/ulo¾ení indexovaná paleta - Vèetnì indexu prùhlednosti pøes Volby->Soubory XBM Otevøení/Ulo¾ení - Vèetnì aktivních bodù pøes Volby->Soubory GIF Otevøení/Ulo¾ení jednoho obrázku s indexovanou paletou volitelnì s indexem prùhlednosti. Jestli¾e máte nainstalovaný Gifsicle, mù¾ete také otevírat a ukládat animované GIFy. TIFF Otevøení/Ulo¾ení 24 bit RGB BMP Otevøení/Ulo¾ení nekomprimované 1, 4, 8 bit indexované palety, nebo 24 bit RGB Pøi otevírání souboru bude mtPaint automaticky zji¹»ovat, o jaký typ souboru se jedná a pøíslu¹nì ho otevøe. Pøi otevírání obrázku, který obsahuje meta data ( název autora, nebo komentáøe), mtPaint neulo¾í tato data, tak¾e pokud jsou pro vás dùle¾itá, musíte vytvoøit nový soubor, abyste zabránili ztrátì dat, která jsou v originálním souboru. Je mo¾né ulo¾it v¹echny aktuální obrázky historie do sekvence PNG souborù. Jdìte do menu Soubor a vyberte "Export obrázkù historie". Vyberte adresáø, do kterého chcete obrázky ulo¾it a následnì zadejte pøedponu souboru v oknì, napø. "out". Obrázky historie budou ulo¾eny do out001.png, out002.png atd. Po dokonèení se mù¾ete pobavit animací tìchto obrázkù a mù¾ete vidìt, jak se va¹e kresba vyvíjela do finální podoby. Nejjednodu¹¹í cesta je pou¾ít pøíkaz z balíku ImageMagick: animate -delay 10 out*.png mtPaint mù¾e exportovat indexovaný obrázek se 16, nebo ménì barvami jako ASCII kresbu (Soubor -> Exportovat jako ASCII kresbu). mtPaint poèítá s tím, ¾e se jedná o obrázek se ¹kálou ¹edi se 16 úrovnìmi intenzity (0=èerná), tak¾e pro konverzi 24bit RGB fotografie na ASCII kresbu musíte provést následující: 1) Zmen¹ete obrázek na ¹íøku okolo 80 pixelù s pomocí zmen¹ení, nebo oøezu 2) Efekty -> ©edá ¹kála 3) Efekty -> Kontrast : Ujistìte se, ¾e má obrázek silný kontrast mezi èernými a bílými plochami 4) Paleta -> Nastavit poèet barev : na 16 5) Nastavte barvu A jako barvu 0 (èerná) a barvu B jako 15 (bílá) 6) Paleta -> Vytvoøit ¹kálu 7) Obrázek -> Pøevést na indexovaný: 16 barev a kvantování do palety 8) Soubor -> Exportovat jako ASCII kresbu : do ~/a.txt ~/a.txt bude potom obsahovat ASCII verzi obrázku, která by mìla být zobrazitelná v editoru, nebo v konzoli s tmavým pozadím a svìtlým textem. Pokud pou¾íváte svìtlé pozadí s tmavým textem, tak jednodu¹e invertujte obrázek po kroku 2).

source: An indexed palette image can have between 2 and 256 colours. At any time you can change the RGB values of a colour by doing one of the following: * Click on the current colour A or B in the top left corner * Press Ctrl-E or Ctrl-W * Access the Palette menu You can then adjust the colour values. If you then confirm the change, this will adjust that colour index and also any pixels on the canvas which have that index. There is a colour protection mask feature which stops certain colours from being painted over on the canvas. This is very useful when you have drawn an outline and then want to fill in between these lines with other colours without affecting the outline. To protect a colour from being painted on, simply left click to the right of its colour in the palette window - a cross should then appear. Click again and the mask will be removed and this colour can be edited on the canvas as normal. The palette menu allows you to set or clear the mask for all colours. This protection affects all basic tools like normal painting or pasting (RGB & Indexed images) but does not affect the global functions like colour transformations. Each colour in the palette is defined by 3 channels - Red, Green and Blue. For each channel there are 8 bits assigned to define its intensity - 0 for nothing, 255 for maximum. While editing a colour you can simulate other bit levels per channel to rationalize the palette from the potential 16777216 colours available. For example, if you use the posterize feature at 3 bits per channel, this will result in a choice of 512 colours, i.e. 8x8x8 or 2^3 x 2^3 x 2^3. I find this setting helpful when recreating artwork from previous generations of home computers - the Atari ST in this case. Sometimes when you posterize an image, you will end up with duplicate palette entries. To merge these together and tidy up the palette you choose the following menu items: 1) Merge duplicate colours This option will find identical palette colours and then scan the canvas to ensure that only one palette index is used. 2) Remove unused colours This option removes any palette colours that do not have pixels on the canvas, and updates the canvas to reflect any index changes. It is possible to generate scales within the whole palette. To do this selection the first colour as A and the second colour as B and the select 'Create Scale' from the Palette menu. mtPaint will then calculate the in between values. It is possible to move a colour entry from one index to another in the palette list. To do this, try the following: 1) Move the mouse pointer to the colour you want to move 2) Press and hold the shift key 3) Press and hold the left mouse button 4) Drag the pointer to the desired index 5) Release the mouse pointer to commit the operation When doing this with an indexed image, the canvas colours will be adjusted to accommodate the change. The RGB canvas remains unchanged. A more generic sort is possible by accessing the 'Palette' menu. When you are editing a 24 bit RGB image the palette behaves slightly differently. For example, when you change a colour in the palette the canvas remains unchanged.
cs: Obrázek s indexovanou paletou mù¾e mít mezi 2 a 256 barvami. Kdykoliv mù¾ete zmìnit RGB hodnoty barvy jednou z tìchto následujících akcí: * Kliknìte na aktuální barvu A, èi B v levém horním rohu * Stisknìte Ctrl-E, nebo Ctrl-W * Jdìte do menu paleta Nyní mù¾ete nastavit hodnoty barvy. Jestli¾e zmìny potvrdíte, zmìní se také index barvy a také v¹echny pixely na plátnì které mají tento index. Je zde také funkce ochranné masky barev, která zabrání pøekreslování urèité barvy na plátnì. Toto je velmi u¾iteèné, pokud máte nakreslen obrys a potom ho chcete vyplnit mezi tìmito linkami jinými barvami bez zásahu do obrysu. Pro ochranu barvy pøed pøekreslováním jednodu¹e kliknìte levým tlaèítkem na pravou stranu této barvy v oknì palety - mìl by se tam objevit køí¾ek. Kliknìte znovu a maska bude odstranìna a tato barva mù¾e být mìnìna na plátnì jako normálnì. Menu palety vám umo¾òuje nastavit, nebo zru¹it masku u v¹ech barev. Tato ochrana ovlivní v¹echny základní nástroje, jako normální kreslení, nebo vkládání (RGB a indexované obrázky), ale neovlivní globální funkce, jako barevné transformace. Ka¾dá barva v paletì je definována 3 slo¾kami - Èervená, Zelená a Modrá. Pro ka¾dou slo¾ku je pøiøazeno 8 bitù pro nastavení její intenzity - 0 pro ¾ádnou, 255 pro maximální. Pøi úpravì barvy mù¾ete simulovat jinou bitovou hloubku na kanál pro zmen¹ení rozsahu palety z 16777216 mo¾ných barev. Napøíklad, pokud pou¾ijete nastavení poètu bitù na barvu na 3 bity na kanál, tak dostanete výbìr z 512 barev, jinak 8x8x8 nebo 2^3 x 2^3 x 2^3. Toto nastavení shledávám u¾iteèné pøi pøedìlávání kresbièek z pøedchozí generace domácích poèítaèù - Atari ST v tomto pøípadì. Nìkdy, pokud mìníte poèet bitù barev, tak skonèíte s duplicitními polo¾kami v paletì. Pro slouèení tìchto barev a uklizení palety vyberte následující polo¾ky menu: 1) Slouèit duplicitní barvy Tato mo¾nost najde shodné barvy v paletì a ujistí se, ¾e se na plátnì opravdu pou¾ívá jen jeden index. 2) Odstranit nepou¾ité barvy Tato mo¾nost odstraní v¹echny barvy, které nejsou vùbec obsa¾eny na plátnì a obnoví plátno, aby se projevily zmìny indexù. Je mo¾né vytvoøit ¹kálu v rámci samotné palety. Pro provedení této funkce vyberte první barvu jako A a druhou barvu jako B a následnì vyberte funkci 'Vytvoøit ¹kálu' z menu paleta. mtPaint následnì spoèítá mezilehlé hodnoty. Je také mo¾né pøesunout barvu z jednoho indexu na jiný v paletì. Pro to je tøeba provést následující: 1) Pøesuòte ukazatel my¹i na barvu, kterou chcete pøesunout 2) Stisknìte a podr¾te klávesu shift 3) Stisknìte a podr¾te levé tlaèítko my¹i 4) Pøesuòte kurzor na po¾adovaný index 5) Pro potvrzení operace uvolnìte levé tlaèítko Pokud toto udìláte s indexovaným obrázkem, budou zmìnìny barvy plátna dle provedených zmìn. RGB plátno zùstane bez zmìn. Vìt¹í mo¾nosti øazení barev jsou v menu 'Paleta'. Pokud pracujete s obrázkem ve 24 bit RGB, tak se paleta chová trochu odli¹nì. Napøíklad, pokud zmìníte odstín barvy v paletì, tak plátno zùstane nezmìnìno.

source: There are several different patterns that you can use to paint onto the canvas. To choose one you must do one of the following: * Click on the current pattern in the top left corner * Press F2 * Access the Edit menu After selecting your desired pattern you must then choose which 2 colours will be used with this pattern. Left click a colour in the palette area to set colour A, and right click to set colour B. The preview area will show you what the final pattern will look like. You can also press Ctrl+Left Button to select colour B if you are using a single button stylus/tablet. While using a painting tool, you can press an arrow key to change colour A or B. If you want to create your own custom patterns you can either edit "patterns.c" in a text editor or edit ./src/graphics/patterns.png with mtPaint. You create your own c file by executing "Edit->Create Patterns". Rename the files accordingly, recompile mtPaint and you should now be able to use your own patterns.
cs: K dispozici je zde mnoho rùzných vzorù, které mù¾ete pou¾ít pro kreslení na plátno. Výbìr vzoru provedete jedním z tìchto zpùsobù: * Kliknìte na aktuální vzor v levém horním rohu * Stisknìte F2 * Jdìte do menu Upravit Po vybrání po¾adovaného vzoru musíte poté vybrat, které 2 barvy budou pou¾ity s tímto vzorem. Kliknutím levým tlaèítkem na barvu v paletì nastavíte barvu A a pravým tlaèítkem barvu B. Oblast s náhledem vám uká¾e, jak bude vypadat finální vzor. Mù¾ete také stisknout Ctrl + levé tlaèítko pro výbìr barvy B, pokud pou¾íváte jednotlaèítkové pero/tablet. Pøi pou¾ívání nástroje malování mù¾ete pomocí kláves ¹ipek mìnit barvu A, nebo B. Pokud si chcete vytvoøit vlastní vzory, mù¾ete buï upravit soubor "patterns.c" v textovém editoru, nebo upravit ./src/graphics/patterns.png v mtPaintu. Vá¹ vlastní c soubor vytvoøíte spu¹tìním "Upravit->Vytvoøit vzory ". Pøejmenujte soubory shodnì, pøekompilujte mtPaint a mìli byste nyní být schopni pou¾ít va¹e vlastní vzory.
