Repository: 12Me21/mtPaint
Catalog: po/*.po
Languages: cs

source: Scale Canvas
cs: Zmìna mìøítka plátna

source: Resize Canvas
cs: Zmìna velikosti plátna

source: Exact Conversion
cs: Pøesná konverze

source: Use Current Palette
cs: Pou¾ít aktuální paletu

source: DL1 Quantize (fastest)
cs: DL1 Kvantování (nejrychlej¹í)

source: DL3 Quantize (very slow, better quality)
cs: DL3 Kvantování (velmi pomalé, lep¹í kvalita)

source: Wu Quantize (best method for small palettes)
cs: Wu Kvantování (nejlep¹í metoda pro málo barev)

source: Flat Colour
cs: Pøímo barvy

source: Dithered
cs: Rozechvìlé

source: Scattered
cs: Rozptýlené

source: You don't have enough unique RGB pixels to reduce to indexed - you must have at least 2.
cs: Nemáte dostatek unikátních RGB pixelù pro redukci na indexovaný obrázek - musíte mít alespoò 2.

source: Convert To Indexed
cs: Pøevod na indexovaný

source: Indexed Colours To Use
cs: Poèet indexovaných barev

source: Loading PNG image
cs: Naèítám PNG obrázek

source: Loading clipboard image
cs: Naèítám obrázek ze schránky

source: Saving PNG image
cs: Ukládám PNG obrázek

source: Saving Clipboard image
cs: Ukládám obrázek ze schránky

source: Saving Layer image
cs: Ulo¾ení obrázku vrstvy

source: Loading GIF image
cs: Naèítám GIF obrázek

source: Saving GIF image
cs: Ukládám GIF obrázek

source: Loading JPEG image
cs: Naèítám JPEG obrázek

source: Saving JPEG image
cs: Ukládám JPEG obrázek

source: Loading TIFF image
cs: Naèítám TIFF obrázek

source: Saving TIFF image
cs: Ukládám TIFF obrázek

source: Loading BMP image
cs: Naèítám BMP obrázek

source: Saving BMP image
cs: Ukládám BMP obrázek

source: Loading XPM image
cs: Naèítám XPM obrázek

source: Saving XPM image
cs: Ukládám XPM obrázek

source: Loading XBM image
cs: Naèítám XBM obrázek

source: Saving XBM image
cs: Ukládám XBM obrázek

source: Saving UNDO images
cs: Ukládám obrázky historie

source: Pressure
cs: Tlak

source: Current Device
cs: Aktuální zaøízení

source: Max memory used for undo (MB)
cs: Max pamìti pro historii (MB)

source: Greyscale backdrop
cs: Odstín ¹edivého pozadí

source: Selection nudge pixels
cs: Posun pixelù výbìru

source: Max Pan Window Size
cs: Velikost pøehledového okna

source: XPM/PNG transparency index
cs: XPM/PNG index prùhlednosti

source: XBM X hotspot
cs: XBM X aktivní bod

source: XBM Y hotspot
cs: XBM Y aktivní bod

source: JPEG Save Quality (100=High)
cs: JPEG Kvalita ukládání (100=Nejlep¹í)

source: Recently Used Files
cs: Naposledy pou¾ité soubory

source: Minimum grid zoom
cs: Rastr pøi zoomu alespoò

source: Grid colour RGB
cs: RGB barva rastru

source: Colour A & B
cs: Barvy A a B

source: Canvas Geometry
cs: Geometrie plátna

source: Cursor X,Y
cs: Kurzor X,Y

source: Selection Geometry
cs: Geometrie Výbìru

source: Continuous Mode
cs: Spojitý re¾im

source: Undo / Redo
cs: Zpìt / Vpøed

source: Opacity %
cs: Neprùsvitnost %

source: Opacity Mode
cs: Re¾im neprùsvitnosti

source: Preferences
cs: Volby

source: Display clipboard while pasting
cs: Zobrazovat schránku pøi vkládání

source: Mouse cursor = Tool
cs: Kurzor my¹i = Nástroj

source: Confirm Exit
cs: Potvrdit konec

source: Q key quits mtPaint
cs: Klávesa Q ukonèí mtPaint

source: Changing tool commits paste
cs: Zmìna nástroje potvrdí vlo¾ení

source: Files
cs: Soubory

source: Clipboard Files
cs: Soubory schránky

source: Browse
cs: Procházet

source: Status Bar
cs: Stavová li¹ta

source: New image sets zoom to 100%
cs: Nový obrázek nastaví zoom na 100%

source: Mouse Scroll Wheel = Zoom
cs: Koleèko na my¹i = Zoom

source: Centralize image
cs: Vystøedit obrázek

source: Device Settings
cs: Nastavení zaøízení

source: Configure Device
cs: Konfigurace zaøízení

source: Tool Variable
cs: Variabilita nástroje

source: Factor
cs: Faktor

source: Test Area
cs: Testovací plocha

source: Default System Language
cs: Výchozí jazyk systému

source: Czech
cs: Èesky

source: English (UK)
cs: Anglicky (UK)

source: French
cs: Francouzsky

source: Portuguese
cs: Portugalsky

source: Portuguese (Brazilian)
cs: Portugalsky (Brazílie)

source: Spanish
cs: ©panìlsky

source: Language
cs: Jazyk

source: Select preferred language translation You will need to restart mtPaint for this to take full effect
cs: Vyberte vá¹ oblíbený jazyk Aby se projevily v¹echny zmìny, je tøeba mtPaint restartovat.

source: %i Files on Command Line
cs: %i Souborù na pøíkazové øádce

source: Help
cs: Pomoc

source: Antialias
cs: Vyhlazení

source: Background colour =
cs: Barva pozadí =

source: Angle of rotation =
cs: Úhel rotace =

source: Enter Text Here
cs: Zadejte text

source: Main
cs: Hlavní

source: View
cs: Zobrazení

source: Focus
cs: Zamìøení
