Repository: 12Me21/mtPaint
Catalog: po/*.po
Languages: cs

source: For some types of painting and image manipulation it is convenient to use multiple layers of images rather than a single image. For example you may want to overlay text or drawings over a photograph and then be able to move or edit each layer independently. To use layers with mtPaint you must first load the image you want to be the background. This is the most important step as all the other layers sit on top of this image (also, the size of the background image determines the size of the final composite image). Next you must create a new layer by using the Layers window ('L' key or View menu). You can then edit, manipulate, load to, or save this new layer just like any other image. The only difference is that this image can have a transparent colour which will show the pixels used on the background image (or lower layers if there are any). You can move any layer around by clicking and dragging it in the the view window, or by pressing CTRL and using the arrow keys (+SHIFT nudges like pasting). There is also a button on the layers window which puts the layer back to the centre of the background image. The layers window allows you to name each layer for convenience and to temporarily hide it by unchecking the toggle button to the right of the layers name. When you decide you want to save this composite image you press the 'Save' button which saves 2 files: 1) A small text file containing information about each layer. 2) The composite image which is a normal RGB PNG file. You can then load these layers back into mtPaint by loading the text file back into mtPaint. Please note that when you save the composite image and text file you are not saving each individual layer. As mentioned earlier, each layer is considered to be its own file and must be saved with the 'File' menu or Ctrl-S as normal. The benefit of treating the layers separately is as follows: 1) Less disk space is required as the layers are not clumped together into a new file. 2) Image layers can be edited with any other image editor. 3) If you are using a standard image for several composite images (e.g. a standard logo or piece of text for watermarking photos), you only need to edit one image and all of the other composite images will be updated automatically the next time you save them. After saving the layers text file you must not move it anywhere else unless you also move the image files with it as these file references are relative. The simplest method is to keep all original images and text files in a single directory. When using layers, the undo memory limit set in the preferences window must be divided by the number of layers to determine the limit per layer. For example, with a 32MB limit and 4 layers there is an 8MB limit per layer for the undo. To see examples of layers, try "mtpaint ./src/graphics/*.txt" from the sources tarball.
cs: Pro nìkteré druhy kreslení a manipulací s obrázky je výhodné pou¾ívat více obrazových vrstev místo jednoho obrázku. Napøíklad mù¾ete chtít na fotografii napsat text nebo nakreslit kresbu a potom mít mo¾nost pøesouvat , nebo mìnit ka¾dou vrstvu zvlá¹». Pokud chcete v mtPaintu pou¾ívat vrstvy, musíte nejprve nahrát obrázek, který bude na pozadí. Toto je nejdùle¾itìj¹í krok, proto¾e v¹echny ostatní vrstvy jsou nad ním (také velikost obrázku umístìného na pozadí udává velikost výsledné kompozice). Dále musíte vytvoøit novou vrstvu pou¾itím okna vrstev (klávesa 'L', nebo menu Zobrazit). Potom mù¾ete upravit, manipulovat, otevøít, nebo ulo¾it tuto novou vrstvu jako ka¾dý jiný obrázek. Jediný rozdíl je v tom, ¾e tento obrázek mù¾e mít prùsvitnou barvu, kterou budouvidìt pixely na pozadí, nebo ni¾¹í vrstvy, pokud nìjaké existují. Kteroukoliv vrstvu mù¾ete libovolnì posouvat jejím oznaèením a pøesunutím v oknì zobrazení, nebo stisknutím CTRL a pou¾itím ¹ipek (+SHIFT jako pøi vkládání). V oknì vrstev je také tlaèítko, které zpùsobí pøesunutí vrstvy zpìt do støedu obrázku na pozadí. Okno vrstev dále umo¾ní pro va¹e pohodlí ka¾dou vrstvu pojmenovat a doèasnì ji skrýt od¹krtnutím tlaèítka na pravé stranì jména vrstvy. A¾ se rozhodnete, ¾e chcete tuto kompozici ulo¾it, tak stisknìte tlaèítko 'Ulo¾it', které ulo¾í 2 soubory: 1) Malý textový soubor obsahující informace o ka¾dé vrstvì. 2) Zkombinovaný obrázek, který je normální RGB PNG soubor. Pozdìji mù¾ete tyto vrstvy nahrát zpìt do programu otevøením toho textového souboru v mtPaintu. je tøeba si uvìdomit, ¾e kdy¾ ukládáte kompozitní obrázek a text, tak se neulo¾í jednotlivé vrstvy. Jak bylo øeèeno døíve, tak ka¾dá vrstva je samostatný soubor a musí být ulo¾ena pomocí menu 'Soubor', nebo Ctrl-S jako normálnì. Výhody tohoto zacházení s vrstvami je následující: 1) Je potøeba ménì diskového prostoru, proto¾e vrstvy nejsou pøidávány do nového souboru. 2) Vrstvy obrázku mohou být upravovány libovolným editorem obrázkù. 3) Pokud pou¾íváte standardní obrázek pro více kompozicí ( napøíklad standardní logo, nebo text pro vodotisk na fotografiích), tak musíte upravit pouze jeden obrázek a ostatní obrázky, které jsou souèástí kompozice budou pøi pøí¹tím ulo¾ení automaticky aktualizovány. Po ulo¾ení textového souboru vrstev ho nesmíte nikam pøesunost, ani¾ byste s ním pøesunuli také obrázky, na které se relativnì odkazuje. Nejjednodu¹¹í zpùsob je nechat v¹echny originální obrázky a textové soubory v jednom adresáøi. Pøi pou¾ívání vrstev musí být pamì» historie v oknì voleb vydìlena poètem vrstev pro odhadnutí limitu na jednu vrstvu. Napøíklad s limitem 32MB a 4 vrstvami je zde limit 8MB na vrstvu pro pamì» historie. Pro pøíklady pou¾ití vrstev spus»te "mtpaint ./src/graphics/*.txt" z adresáøe zdrojových kódù.

source: If you have created a composite image with 2 or more layers you can use mtPaint to automatically move these layers in a sequence. The results can be previewed and then output to a series of image files ready for packing into an animation, such as a GIF or MPEG file. The first step is to create the image layers and save the layers file. Once you have done this you need to plan and coordinate what layers will move at what moment in time. Once this is clear in your mind you can use the Frames menu to set up and configure your animation. Initially you must set up general issues like frame numbers, file names and so on. You must then set the layer positions for each of the frames. A quick way to set this is to use the "Set key frame" menu operation. The positions tab will show you each of the current layers in a list on the left. If you click on one of these you can then edit the text box on the right to set the positions for this layer. You are able to define up to 100 positions for each layer, with a separate line for each position. 5 numbers should be entered into each line, with a tab separating each number. The syntax is as follows: frame x y opacity effect For this to work properly each successive line must have a frame number that is greater than or equal to the previous line. There is also a cycles tab which is used to determine which layers are visible at any particular time. Up to 100 lines can be entered in the following format: frame1 frame2 layer1, layer2, layer3, ... , layer50 Up to 50 layers can be listed on each line. Between the 2 frames of the animation only one of the sequence will be visible, with the others being switched off. As the frame increments, the next layer in the sequence will be shown, and the previous one hidden. For example: 1 10 1, 2, 3 Will cycle the visibility of layers 1, 2, 3 between frames 1 and 10. Normally frame2 will be greater than frame1, but if they are equal you can then manually set which layers are visible or invisible at that frame. For example: 15 15 10, 11, 12, -1, -2, -3 Will show layers 10, 11, 12 and hide layers 1, 2, 3 at frame 15.
cs: Pokud jste vytvoøili kompozitní obrázek se dvìma, nebo více vrstvami, mù¾ete mtPaint nechat automaticky s nimi posunovat v sekvenci. Výsledek mù¾e být zobrazen a dále ulo¾en do série obrázkù pøipravených pro slo¾ení animace, jako je animovaný GIF, nebo soubor MPEG. První krok je vytvoøení vrstev obrázku a ulo¾ení vrstvového souboru. A¾ budete hotovi, musíte naplánovat a zkoordinovat, které vrstvy se budou pohybovat ve který moment v èase. Jakmile je vám to jasné, mù¾ete jít do menu Snímky a nastavit tam va¹i animaci. Nejdøíve musíte nastavit základní parametry, jako je poèet snímkù, názvy souborù atd. Potom musíte nastavit pozice vrstev pro ka¾dý ze snímkù. Rychlá cesta, jak to nastavit je pou¾ití funkce "Nastavit klíèový snímek" v menu. Zálo¾ka pozice nám uká¾e ka¾dou z aktuálních vrstev v seznamu nalevo. Pokud na nìkterou kliknete, mù¾ete následnì upravovat textové pole vpravo, kde nastavíte pozice pro tuto vrstvu. Máte mo¾nost definovat a¾ 100 pozic pro ka¾dou vrstvu s oddìlovacím øádkem pro ka¾dou pozici. Na ka¾dý øádek by mìlo být vlo¾eno 5 èísel oddìlených tabulátorem. Syntaxe je následující: snímek x y neprùsvitnost efekt Pro správnou funkci musí mít ka¾dá dal¹í øádka èíslo snímku, které je vy¹¹í, nebo stejné jako na pøedchozí øádce. Je zde také zálo¾ka cyklu, která se pou¾ívá k urèení, které vrstvy jsou viditelné v konkrétním èase. A¾ 100 øádek mù¾ete vlo¾it v následujícím formátu: snímek1 snímek2 vrstva1, vrstva2, vrstva3, ... , vrstva50 Na ka¾dé øádce mù¾ete specifikovat a¾ 50 vrstev. Mezi dvìma snímky animace bude viditelná jen jedna sekvence a ostatní budou vypnuty. Jak se snímky naèítají, tak se zobrazí dal¹í vrstva v sekvenci a pøedchozí zmizí. Napøíklad: 1 10 1, 2, 3 Bude cyklovat viditelnost vrstev 1, 2, 3 mezi snímky 1 a 10 Normálnì bude snímek 2 vy¹¹í, ne¾ snímek 1, ale pokud jsou stejné, tak mù¾ete ruènì nastavit, které vrstvy jsou viditelné a které nikoliv na daném snímku. Napøíklad: 15 15 10, 11, 12, -1, -2, -3 Zobrazí vrstvy 10, 11, 12 a skryje vrstvy 1, 2, 3 na snímku 15.

source: Ctrl-N Create new image Ctrl-O Open Image Ctrl-S Save Image Ctrl-Q Quit program Ctrl-A Select whole image Escape Select nothing, cancel paste box Ctrl-C Copy selection to clipboard Ctrl-X Copy selection to clipboard, and then paint current pattern to selection area Ctrl-V Paste clipboard to centre of current view Ctrl-K Paste clipboard to location it was copied from Enter/Return Commit paste to canvas Arrow keys Paint Mode - Change colour A or B Arrow keys Selection Mode - Nudge selection box or paste box by one pixel Shift+Arrow keys Nudge selection box or paste box by x pixels - x is defined by the Preferences window Delete Crop image to selection Insert Transform colours - i.e. Brightness, Contrast, Saturation, Posterize, Gamma Ctrl-G Greyscale the image Ctrl-T Draw a rectangle around the selection area with the current fill Ctrl-Shift-T Fill in the selection area with the current fill Ctrl-L Draw an ellipse spanning the selection area Ctrl-Shift-L Draw a filled ellipse spanning the selection area Ctrl-E Edit the RGB values for colours A & B Ctrl-W Edit all palette colours Ctrl-P Preferences Ctrl-I Information Ctrl-Z Undo last action Ctrl-R Redo an undone action C Command Line Window V View Window L Layers Window Z Set zoom +,= Zoom in - Zoom out 1 10% zoom 2 25% zoom 3 50% zoom 4 100% zoom 5 400% zoom 6 800% zoom 7 1200% zoom 8 1600% zoom 9 2000% zoom F1 Help F2 Choose Pattern F3 Choose Brush F4 Paint Tool F5 Pixel Shuffle F6 Flood Fill F7 Straight Line F8 Smudge F9 Selection Tool F11 Toggle normal or continuous painting mode F12 Toggle undo opacity mode Ctrl + F1 - F12 Save current clipboard to file 1-12 Shift + F1 - F12 Load clipboard from file 1-12 Ctrl + 1, 2, ... , 0 Set opacity to 10%, 20%, ... , 100% (main or keypad numbers) Ctrl + + or = Increase opacity by 1% Ctrl + - Decrease opacity by 1% Home Show or hide main window menu/toolbar/status bar/palette Page Up Scale Image Page Down Resize Image canvas End Pan Window
cs: Ctrl-N Vytvoøit nový obrázek Ctrl-O Otevøít obrázek Ctrl-S Ulo¾it obrázek Ctrl-Q Ukonèit program Ctrl-A Vybrat celý obrázek Escape Zru¹it výbìr, vkládání Ctrl-C Zkopírovat výbìr do schránky Ctrl-X Zkopírovat výbìr do schránky, a potom vyplnit oblast výbìru aktuálním vzorem Ctrl-V Vlo¾it schránku do støedu obrázku Ctrl-K Vlo¾it schránku do míst, odkud byla kopírována Enter/Return Potvrdit vlo¾ení na plátno Klávesy ¹ipek Re¾im kreslení - Zmìna barvy A, nebo B Klávesy ¹ipek Re¾im výbìru - Posun oblasti výbìru, nebo vkládání o jeden pixel Shift+¹ipky Posun oblasti výbìru, vkládání o x pixelù - x je definováno v oknì voleb Delete Oøíznout obrázek dle výbìru Insert Transformovat barvy - jako Jas, Kontrast, Saturace, bitù na barvu, Gamma Ctrl-G Pøevést na ¹kálu ¹edi Ctrl-T Nakreslit obdélník okolo oblasti výbìru aktuální barvou Ctrl-Shift-T Vyplnit oblast výbìru aktuální barvou Ctrl-L Nakreslit elipsu uvnitø oblasti výbìru Ctrl-Shift-L Nakreslit vyplnìnou elipsu uvnitø oblasti výbìru Ctrl-E Upravit RGB hodnoty pro barvy A a B Ctrl-W Upravit v¹echny barvy palety Ctrl-P Volby Ctrl-I Informace Ctrl-Z Vrátit poslední akci Ctrl-R Znovu provést vrácenou akci C Okno pøíkazové øádky V Okno zobrazení L Okno vrstev Z Nastaví zoom +,= Pøiblí¾it - Vzdálit 1 10% zoom 2 25% zoom 3 50% zoom 4 100% zoom 5 400% zoom 6 800% zoom 7 1200% zoom 8 1600% zoom 9 2000% zoom F1 Pomoc F2 Vybrat vzor F3 Vybrat ¹tìtec F4 Nástroj malování F5 Pøehození pixelù F6 Vyplnìní F7 Rovná èára F8 Rozmazání F9 Nástroj výbìru F11 Pøehození normálního a spojitého re¾imu malování F12 Pøehození prùsvitnosti re¾imu historie Ctrl + F1 - F12 Ulo¾í aktuální schránku do souboru 1-12 Shift + F1 - F12 Naète soubor 1-12 do schránky Ctrl + 1, 2, ... , 0 Nastaví neprùsvitnost na 10%, 20%, ... , 100% (hlavní i numerická klávesnice) Ctrl + + or = Zvý¹í neprùsvitnost o 1% Ctrl + - Sní¾í neprùsvitnost o 1% Home Zobrazí, nebo skryje hlavní nabídku, panely, nástroje a paletu Page Up Zmìna mìøítka plátna Page Down Zmìna velikosti plátna End Pøehledové okno

source: Left button Paint to canvas using the current tool Middle button Set the centre for the next zoom Right button Commit paste to canvas / Stop drawing current line / Cancel selection Scroll Wheel In GTK+2 the user can have the scroll wheel zoom in or out via the Preferences window Ctrl+Left button Choose colour A from under mouse pointer Ctrl+Right button Choose colour B from under mouse pointer Shift+Right button Set the centre for the next zoom You can fixate the X/Y co-ordinates while moving the mouse: Shift Constrain mouse movements to vertical line Shift+Ctrl Constrain mouse movements to horizontal line
cs: Levé tlaèítko Malování na plátno s pomocí aktuálního nástroje Støední tlaèítko Nastaví støed pro dal¹í zmìnu velikosti Pravé tlaèítko Potvrdí vlo¾ení na plátno / Pøeru¹í kreslení èáry / Zru¹í výbìr oblasti Koleèko my¹i V GTK+2 mù¾e mít u¾ivatel koleèko ke zmìnì pøiblí¾ení nastavením v oknì voleb Ctrl+Levé tlaèítko Výbìr barvy A z pod ukazatele my¹i Ctrl+Pravé tlaèítko Výbìr barvy B z pod ukazatele my¹i Shift+Pravé tlaèítko Nastaví støed pro dal¹í zoom Mù¾ete také zablokovat X/Y osy pøi posouvání my¹i: Shift Omezí posuny my¹í na vertikální osu Shift+Ctrl Omezí posuny my¹í na horizontální osu

source: I have set the maximum image geometry to 16384x16384. The minimum geometry is 1x1. After loading a new palette, the canvas may contain references to colours that are not defined. I call these orphan pixels. If you examine the image information via the Image menu you will see how many pixels have been orphaned. You can retrieve the pixels by expanding the palette to 256 items and then "Palette->Remove Unused Colours". When using the colour A/B editor, if colour A = colour B, you must edit colour B to change its RGB. On some systems there are problems when editing large images at high zoom levels, e.g. 2048x2048 @ 1600% Some key combinations may not work under certain window managers, e.g. Shift+F1-F12 or Ctrl+Mouse button. Using the status bar items "Cursor X,Y" and "Pixel [I] {RGB}" can cause high CPU usage on older hardware when moving the cursor vigorously. mtPaint does not support alpha channels so if you load a PNG file with an alpha channel, the image may not look correct. However, mtPaint is capable of loading and saving a PNG file with a single colour transparency on both RGB and Indexed Palette images. The maximum number of layers is 100. Text rotation does not work in Windows ME/95. The polygon line selection in Windows is not as clear as the GNU/Linux version.
cs: Nastavil jsem maximální velikost obrázku na 16384x16384. Minimální velikost je 1x1. Po naètení nové palety mù¾e plátno obsahovat odkazy na barvy, které nejsou nadefinované. Nazývám je sirotky. jestli¾e otevøete z menu informace o obrázku, tak uvidíte, kolik pixelù se stalo sirotky. Pixely mù¾ete navrátit zvìt¹ením palety na 256 polo¾ek a následujícím krokem "Paleta->Odstranit nepou¾ité barvy". Pokud pou¾ijete editor barvy A/B a jestli¾e barva A = barva B, tak musíte pro zmìnu její hodnoty zmìnit barvu B. Na nìkterých systémech mù¾e být problém pøi úpravì velkých obrázkù pøi velkém pøiblí¾ení, jako 2048x2048 @ 1600% Nìkteré klávesové kombinace nemusí pod nìkterými správci oken pracovat, napø. Shift+F1-F12, nebo Ctrl+tlaèítko my¹i. Pou¾ití polo¾ek stavové li¹ty "Kurzor X,Y" a "Pixel [I] {RGB}" mù¾e zpùsobit vysoké zatí¾ení CPU na star¹ím hardware pøi mohutném pøesunování my¹i. mtPaint nepodporuje alfa kanály, tak¾e pøi naètení PNG obrázku s alfa kanálem mù¾e obrázek vypadat nesprávnì. Nicménì mtPaint je schopen otevøít a ulo¾it PNG soubor s jednou transparentní barvou v obou typech obrázkù s RGB a Indexovanou paletou. Maximální poèet vrstev je 100. Rotace textu nefunguje na Windows ME/95. Výbìr polygonem není ve Windows tak èistý jako v GNU/Linux verzi.

source: Palette If you are editing an RGB image and you want to populate the palette with colours from the image, the easiest way to do this is to call up the "Edit all colours" window and then use the eye dropper tool to select the colours you want. Moreover, you can use this method to grab any colours on your current desktop. This feature is only available with GTK+2. If you want a more approximate method you could try: 1) Use "Palette->Set Palette Size" to set the size of the palette 2) Use "Palette->Create Quantized" to approximate the palette to the image Effects When I emboss an image I usually like to emphasise the effect by using the "Transform Colour" window to reduce the saturation to greyscale and increase the contrast to highlight the edges. Files If you are using several clipboards and you want to have more control over the images (e.g. rotate them to any angle or apply effects), open all of the clipboards in a new mtPaint process with: mtpaint ~/.clip* You can then edit/save the clipboards in one mtPaint window and then apply them to your main image in another mtPaint window. It is possible to use mtPaint to create fade frames for use in animations. To fade an image you must: 1) Load the relevant frame you want to fade 2) Open the transform window and set brightness to -32 3) Click apply 8 times 4) Save undo images for fading out and save undo images (reverse) for fading in Quantizing If you want to quantize an RGB photo down to just a few colours (e.g. 32) and get the best quality without waiting for a full DL3 quantize you could try the following: 1) Use DL1 to reduce the image to 256 colours 2) Convert to RGB 3) Use DL3 to reduce the image to 32 colours This example illustrates the fact that DL3 takes time proportionate to the number of unique colours in the image. You could also reduce the number of colours in the image by posterizing to a level of 3 or 4 and then trying DL3. Text mtPaint has support for adding basic text strings to an image, but if you want more advanced text features like justification, you can always type some text into your favourite editor/wordprocessor, grab a screenshot and then paste the result. If you paste with the background colour as a transparency, the text can flow around the image. Screenshots mtPaint can be used to grab a screenshot with either File->New or using "mtpaint -s" from the command line. If you are an IceWM user you can assign the key "Print Screen" to grab a screenshot by editing the file ~/.icewm/keys to include: key "Print" mtpaint -s Brushes If you have a particular preference for certain types of brushes, such as circles or sprays, you can manually edit the sources to cater for your needs. Edit memory.c and find mem_brush_list which defines all of the brushes. Each entry is defined by a tool type, tool size and flow.
cs: Paleta Jestli¾e upravujete RGB obrázek a chcete paletu vyplnit barvami z obrázku, tak nejjednodu¹¹í cesta, jak to udìlat, je zavolat funkci"Vybrat v¹echny barvy" a potom pou¾ít nástroj kapátko pro výbìr barvy, kterou chcete. Ale více, vy mù¾ete pou¾ít tuto metodu pro výbìr jakékoliv barvy na va¹í plo¹e. Tato funkce je k dispozici pouze s GTK+2. Pokud chcete více pøibli¾nou metodu, mù¾ete zkusit toto: 1) Pou¾ijte "Paleta->Nastavit poèet barev" pro nastavení velikosti palety 2) Pou¾ijte "Paleta->Vytvoøit kvantované" pro pøiblí¾ení palety obrázku Efekty Pokud vytváøím z obrázku reliéf, tak obvykle chci upravit efekt pou¾itím okna "Transformovat barvy" pro sní¾ení saturace barev na ¹edou a zvý¹ení kontrastu pro zvýraznìní hran. Soubory Pokud pou¾íváte více schránek a chcete mít vìt¹í kontrolu nad obrázky (jako otoèit je kamkoliv, nebo aplikovat efekt), otevøete v¹echny schránky v novém procesu mtPaintu pomocí: mtpaint ~/.clip* Mù¾ete potom upravit/ulo¾it schránky v jednom mtPaint oknì a potom je aplikovat na hlavní obrázek v oknì jiném. je mo¾né mtPaint pou¾ít pro efekt zatmívání pro pou¾ití v animacích. Pro zatmívání proveïte následující: 1) Naètìte snímek, který chcete zatmívat 2) oteøete okno transformace barev a nastavte jas na -32 3) Kliknìte Provést 8 krát 4) Pro zatmívání proveïte export obrázkù historie a pro rozsvícení export obrázkù historie (reverznì) Kvantování Pokud chcete v RGB fotografii sní¾it poèet barev jen na nìkolik (napø. 32) a chcete získat vysokou kvalitu bez èekání na plnou DL3 kvantizaci, mù¾ete zkusit následující: 1) Pou¾ijte DL1 pro sní¾ení poètu barev na 256 2) Pøeveïte na RGB 3) Pou¾ijte DL2 pro sní¾ení poètu barev na 32 Tento pøíklad nám ukazuje fakt, ¾e poèet unikátních barev v obrázku prodlou¾í proporcionálnì èas na DL3 kvantizaci. Mù¾ete také sní¾it poèet barev v obrázku nastavením bitù na barvu na 3. nebo 4 a následným spu¹tìním DL3. Text mtPaint má podporu pro vkládání jednoduchých textù do obrázku, ale pokud chcete více pokroèilé textové funkce, jako zarovnávání, mù¾ete v¾dy napsat text ve va¹em oblíbeném editoru/wordprocessoru a sejmout obrazovku a vlo¾it výsledek. Pokud vkládáte s barvou pozadí jako transparentní, mù¾e text plout jakoby nad obrázkem. Snímání obrazovky mtPaint mù¾e být pou¾itý pro sejmutí obrazovky pøes Soubor->Nový, nebo "mtpaint -s" z pøíkazové øádky. Pokud jste u¾ivatel IceWM, mù¾ete pøiøadit klávesu "Print Screen" sejmutí obrazovky upravením souboru ~/.icewm/keys pøidáte: key "Print" mtpaint -s ©tìtce Pokud máte speciální po¾adavky na rùzné druhy ¹tìtcù, jako kru¾nice, nebo spreje, mù¾ete manuálnì upravit zdrojáky pro splnìní va¹ich potøeb. Upravte memory.c a najdìte mem_brush_list, který definuje v¹echny ¹tìtce. Ka¾dá polo¾ka je definována typem nástroje, velikostí a bohatostí.
