Repository: 12Me21/mtPaint
Catalog: po/*.po
Languages: cs

source: The most basic tool is the Paint tool which paints pixels onto the canvas. To pick a brush for the paint tool press F3, access the Edit menu, press the brush icon or press the preview area. Each brush can be configured by setting the size spin button. The spray also requires the user to set the flow. The higher the number the more pixels will be splattered onto the canvas. If at any time you make a mistake, you can always use the undo/redo functions. Memory permitting, this is for up to 100 actions. You can change the maximum memory limit for the undo feature in the preferences window. By pressing F11 or using the Edit menu you can set painting mode to "Continuous". A "CON" will then appear on the status bar for a visual reminder. This mode means that mtPaint will fill in the area between static shapes while the tool is being used. This is very useful for drawing outlines or using the slash/backslash for calligraphy style effects. When you are editing an RGB image it is possible to change the opacity of certain tool operations. For example if you press Ctrl+3 you will set opacity to 30% which means that if you draw a rectangle over an area, it will paint the current pattern with 30% transparency so you will still see some of what was on the canvas originally. Opacity works with static tool shapes, spray, straight line and pasting. It does not affect flood fill or pixel shuffling. Tool opacity behaviour can be altered by pressing F12 or accessing the Edit menu to toggle the opacity drawing mode ("OP" should appear on the status bar as a reminder). By setting this toggle to off you can get some very interesting results with the spray or by dragging and pasting at the same time. In different situations you may want either behaviour so it is probably best to experiment to learn what the possibilities are. The line tool is used by clicking on the 'Straight Line' ruler icon on the toolbar or F8. You click and release the left mouse button on the canvas where you want to start the straight line. You then move the pointer to the end point and click again to draw the line. Pressing escape or the right button will cancel the operation and stop line drawing until you press the left button again. You can also add an arrowhead to the end of the line by pressing the 'A' (open head) or 'S' (closed head) keys. The size of the arrowhead is determined by the tool flow value. The text tool can be used to add basic text strings to an image. Firstly you choose the colours and pattern you want, then click on the 'T' icon or use the 'Edit->Paste Text' menu option. Type the text you want and then choose the font. Once this is done you can drag the text around the image as it becomes a normal paste box. If you are using GTK+2 and editing an RGB image you also have the option of having antialiased text for smoother edges around the text. GTK+2.6 users have the luxury of rotating the text to any angle. All versions support rotating by 90 degree steps with the rotate selection icons or the Selection menu. While pasting text you can also change the colour or pattern on the fly. If you are editing a large image or are zoomed in heavily you may find the pan window useful to navigate around quickly. The pan window can be invoked by pressing the 'End' key, using the View menu or pressing the icon on the toolbar. This will then bring up a thumbnail of the whole image with a rectangle showing what portion is currently being viewed. Left clicking or dragging the mouse will move the centre of the image to where you click. The arrow keys can be used to move the view in the appropriate direction. Any other keypress (including the 'End' key) or the right button will close the pan window . While using the pan window, the zoom keys (0-9, +, -) and the Home key work as normal. The size of the pan window can be set with the preferences window. If you are editing an image at a high zoom and you would like to see what the normal sized image looks like at the same time, you may find the View Window useful. Press 'V' or use the View menu to call this window up. The clone tool is used to copy chunks from one part of the image to the other. After selecting the clone tool you must set the tool size, e.g. 25, then move the mouse cursor over the canvas area. Then if you hold the Ctrl key down and move the mouse you will see the tool perimeter (black and white) move away from the clone perimeter (black and red). After releasing Ctrl you can then press the left mouse button to copy from the red/black box to the white/black box. When editing an RGB image you can also use variable opacity - this behaviour is governed by whether you are using 'Opacity Undo Mode' or not fom the Edit menu. If you have configured a pressure sensitive graphics tablet you can use this device in mtPaint. To configure this input you use the Tablet section of the preferences window where you must choose the device and then determine which variables the pressure will vary. The tint mode is used by the painting tools to adjust the canvas pixel relative to the current painting pattern and colour. In RGB mode this means adjusting each RGB channel, and in indexed mode the pixel index is changed. When using the normal paint brushes the left mouse button tints by adding, and the right mouse button tints by subtracting. For lines, rectangles, ellipses and polygons you set the +- toggle to determine the direction.
cs: Nejzákladnìj¹í nástroj je nástroj Malování, který kreslí pixely na plátno. Pro výbìr ¹tìtce na malování stisknìte F3, jdìte do menu Upravit, kliknìte na ikonu ¹tìtce, nebo na oblast s náhledem. Ka¾dému ¹tìtci mù¾eme mìnit jeho velikost tlaèítkem na plo¹e. Sprej také vy¾aduje od u¾ivatele nastavení bohatosti. Vìt¹í èíslo znamená, ¾e bude na plátno nastøíkáno více pixelù. Pokud kdykoliv udìláte chybu, mù¾ete v¾dy pou¾ít funkce Zpìt/Vpøed. Pamì» pro historii je nastavena na 100 akcí. Maximální limit pamìti pro zpìtnou funkci mù¾ete zmìnit v oknì nastavení voleb. Stisknutím F11, nebo pou¾itím menu Upravit mù¾ete pøepnout re¾im kreslení na "spojité malování". Na stavové li¹tì se pro informaci objeví zkratka "CON". Tento re¾im znamená, ¾e mtPaint vyplní prostor mezi kreslenými útvary bìhem pou¾ívání nástrojù. To je u¾iteèné pøi kreslení okrajù, nebo pøi pou¾ití lomítka a zpìtného lomítka pro kaligrafický efekt. Pokud upravujete RGB obrázek, mù¾ete zmìnit neprùsvitnost pøi práci s nìkterými nástroji. Pokud napøíklad stisknete Ctrl+3, tak nastavíte neprùsvitnost na 30%, co¾ znamená, ¾e pokud nyní namalujete na plo¹e obdélník, tak se vykreslí aktuálním vzorem s 30% prùhledností, tak¾e èásteènì uvidíte, co bylo na plátnì pøedtím. Neprùsvitnost pracuje s nástroji statických útvarù. sprejem, rovnou èárou a vkládáním ze schránky. Není ovlivnìna funkce vyplnìní, nebo posun pixelu. Chování funkce neprùsvitnosti mù¾e být pøepnuto pomocí F12, nebo pøepnutím Neprùsvitného re¾imu v menu Upravit. ("OP" by se mìlo objevit na stavové li¹tì, pokud je funkce zapnutá). Vypnutím tohoto pøepínaèe mù¾ete dosáhnout velmi zajímavých výsledkù se sprejem, nebo ta¾ením a vkládáním ve stejný okam¾ik. V rùzných situacích mù¾ete chtít rùzné výsledky, tak¾e nejlep¹í bude, kdy¾ si to vyzkou¹íte a zjistíte, jaké jsou mo¾nosti. Nástroj rovná èára pou¾ijete kliknutím na ikonu pravítka, nebo stisknutím F8. Stisknìte a uvolnìte levé tlaèítko my¹i na plátnì, kde chcete zaèít rovnou èáru. Potom posuòte kurzor na cílové místo a dal¹ím kliknutím nakreslíte èáru. Stisknutím Escape, nebo pravého tlaèítka pøeru¹íte operaci a zastavíte kreslení èáry, dokud znovu nestiknete levé tlaèítko my¹i. Mù¾ete také pøidat znak ¹ipky na konec èáry stisknutím klávesy'A' (otevøená ¹ipka), nebo 'S' (uzavøená ¹ipka). Velikost ¹ipky je dána nastavením bohatosti. Nástroj text mù¾e být pou¾itý pro pøidání jednoduchých nápisù do obrázku. Nejdøíve vyberte barvy a vzorek, který chcete a potom kliknìte na ikonu 'T', nebo vyberte volbu menu 'Upravit -> Vlo¾it text'. Napi¹te text, který chcete a potom vyberte font. A¾ to udìláte, mù¾ete posouvat textem jako s normálním vkládacím boxem. Pokud pou¾íváte GTK+2 a upravujete RGB obrázek, máte k dispozici mo¾nost mít vyhlazený text s jemnìj¹ímí hranami okolo nìj. U¾ivatelé GTK+2.6 mají luxus v podobì rotace textu v libovolném úhlu. V¹echny verze podporují rotaci po 90 stupních s ikonou rotace výbìru, nebo z menu. Bìhem vkládání mù¾ete také okam¾itì zmìnit barvu, nebo vzorek. Pokud upravujete rozsáhlej¹í obrázek, nebo je hodnì zvìt¹ený, mù¾e se vám hodit pøehledové okno pro rychlou navigaci. Pøehledové okno lze vyvolat stisknutím klávesy 'End', pou¾itím menu Zobrazit, nebo stisknutím ikony na li¹tì. To vyvolá zobrazení zmen¹eniny celého obrázku s vynaèením právì zobrazované oblasti. Kliknutím, nebo pøesunutím my¹i pøesunete støed obrázku do místa, kam ukazuje kurzor. Pro pøesun patøièným smìrem mù¾ete pou¾ít také klávesy ¹ipek. Jakákoliv jiná klávesa (vèetnì klávesy 'End'), nebo pravé tlaèítko my¹i zpùsobí zavøení pøehledového okna. Pøi pou¾ití pøehledového okna lze klávesy pøiblí¾ení (0-9, +, -) a klávesu Home pou¾ívat jako normálnì. Velikost pøehledového okna lze nastavit v oknì voleb. Pokud upravujete obrázek ve velkém pøiblí¾ení a chcete zároveò vidìt, jak vypadá v normální velikosti, bude se vám hodit Okno Zobrazení. Stisknìte 'V', nebo pou¾ijte menu Zobrazit pro jeho vyvolání. Nástroj klonování se pou¾ívá pro kopírování jedné èásti obrázku do jiné. Po výbìru funkce klonování musíte nastavit velikost nástroje, tøeba 25, potom posunout kurzor nad plátno. Potom, kdy¾ podr¾íte klávesu Ctrl a budete posunovat my¹í, tak uvidíte obrys nástroje (èernobílý), jak se posunuje pryè od klonovacího obrysu (èernoèervený). Po uvolnìní Ctrl mù¾ete pomocí levého tlaèítka my¹i kopírovat z èervenoèerného ètverce do bíloèerného ètverce. Pøi úpravì RGB obrázku mù¾ete také pou¾ít rùznou neprùhlednost - toto chování je øízeno pou¾itím funkce 'Neprùsvitný re¾im historie' z menu Upravit. Pokud máte nakonfigurován tlakovì citlivý grafický tablet, mù¾ete ho v mtPaintu pou¾ít. Pro jeho konfiguraci pou¾ijte sekci Tablet v oknì voleb, kde musíte vybrat zaøízení a následnì zjistit, které hodnoty se mìní spoleènì se zmìnou pøítlaku Re¾im kolorování se pou¾ívá s kreslícími nástroji ke zmìnì barvy pixelù plátna relativnì k aktuálnímu kreslícímu vzoru a barvì. V RGB re¾imu to znamená zmìnu ka¾dého RGB kanálu a v indexovém re¾imu se zmìní index jednotlivého pixelu.Pøi pou¾ití normálních ¹tìtcù levé tlaèítko koloruje pøiètením a pravé tlaèítko odeètením hodnoty kanálù, nebo indexu. Pro èáry, obdélníky, elipsy a polygony nastavíte +- pøepínaè pro urèení smìru.

source: In order to make a selection you press the 'Make Selection' icon on the toolbar or press Ctrl-A to select the whole image. You then click the left mouse button on the canvas and drag the rectangle to the area you want to select. To clear this selection press Escape, the right mouse button, Ctrl+Shift-A or use the Edit menu. The selection box can be moved around pixel by pixel by using the arrow keys. Pressing Shift and the arrow keys causes the selection box to be moved a set number of pixels determined by the Preferences window. After you have made a selection you can click and drag the corners to new positions. With the tool mouse cursor option switched on you will see the relevant corner arrow to indicate this new behaviour. Once a selection has been made you can select 'Crop' from the Image menu, or press the delete key which will reduce the canvas size to the selected area. Cropping will not be possible if the whole canvas is selected. Pressing Ctrl-C causes the selection area to be copied to the clipboard ready for pasting. Pressing Ctrl-X causes the selection area to be copied to the clipboard and then this area of the canvas is filled with the current pattern - apart from pixels that have been protected with the colour mask. Pressing Ctrl-V pastes the clipboard onto the canvas at the centre of the view. Pressing Ctrl-K pastes the clipboard onto the canvas at the position from which it was copied. While pasting, the arrow keys can be used to position the box before committing the operation. Escape cancels the operation and removes the paste box. Also, if you have selected to show tool shaped cursors in "Image->Preferences", by moving the mouse over the paste box the cursor will change to a four way arrow. While doing this, you can press the left mouse button and you will be able to drag the paste box. In order to commit the paste operation, press the right mouse button or the Enter/Return key. By pressing both mouse buttons down and dragging you can use the clipboard image as a brush. When you are editing an image with a colour protection mask, you stop these colours being changed on the canvas. When you are pasting it is possible to use a colour transparency mask to enable the pasting of non rectangular shapes. The easiest way to understand this is to try the following example: 1) Type "mtpaint src/graphics/testcard.png" 2) Press Ctrl-A, then Ctrl-C, then Ctrl-V. 3) You will then be able to move the paste clipboard as normal. 4) If you then select "Selection -> Mask Colours A,B" from the menu you will make red and black colours on the clipboard transparent. 5) To return to normal, select "Selection -> Clear Mask" 6) Further colours can be masked on a cumulative basis by selecting them via the palette and using "Selection -> Mask Colours A,B" again. I have put an option into the preferences window so that you can choose not to have the clipboard image displayed while moving the paste box. In other words, you will simply see the blue/white outline until you commit the operation. The selection tool is also used to direct several other painting functions. These are located under the "Selection" menu. For example, you can fill the current selection rectangle or draw an ellipse. As well as rectangle selections, you can use the polygon selection tool to create polygon shapes in order to fill, outline, copy, cut and paste. After selecting this tool you click the left mouse button on the canvas where you want to start forming the polgon shape. You can then either hold the left button down for a freehand shape or release it to have a long straight edge. To finish press the right button. You can also create an polygon by holding down the right mouse button and then dragging. In this case, releasing the right button completes the polygon. To cancel the shape press the Escape key. Once a polygon selection has been made you can use the lasso tool to shrink wrap the edges of the selection with the same colour. For example if you have a black background with a red circle, a rough freehand polygon around it followed by pressing the lasso icon will create a paste of just the red circle with the black area removed. Using the Selection menu you can also 'lasso cut' an area which fills the lasso selected area on the canvas.
cs: Pro oznaèení èásti obrázku kliknìte na ikonu 'Oznaèit výbìr' na li¹tì, nebo stisknìte Ctrl-A pro oznaèení celého obrázku. Potom kliknìte levým tlaèítkem na plátno a posunujte obdélníkem, aby ohranièoval po¾adovanou oblast výbìru. Pro zru¹ení výbìru stisknìte Escape, pravé tlaèítko my¹i, Ctrl+Shift-A, nebo pou¾ijte menu Upravit. Oblast výbìru mù¾e být posouvána po pixelech pomocí klávesových ¹ipek. Stisknutím klávesy Shift a ¹ipky zpùsobíte pøesun oznaèené oblasti o daný poèet pixelù nastavený v oknì voleb. Po té, co jste provedli výbìr, mù¾ete my¹í pøesunout rohy oznaèené oblasti do nové pozice. S nastavením kurzoru my¹i na nástroj uvidíte odpovídající rohové ¹ipky naznaèující tyto nové mo¾nosti pøesunu. Pokud provedete oznaèení oblasti, mù¾ete vybrat na li¹tì 'Oøíznout', nebo stisknout klávesu Delete, co¾ zpùsobí zmen¹ení velikosti plátna na oznaèenou oblast. Oøíznutí nebude mo¾né, jestli¾e bude oznaèené celé plátno. Stisknutím Ctrl-C provedete zkopírování oznaèené oblasti do schránky. Stisknutím Ctrl-X provedete zkopírování oznaèené oblasti do schránky a tato oblast plátna bude vyplnìna aktuálním vzorem, kromì pixelù, které jsou chránìné barevnou maskou. Stisknutím Ctrl-V vlo¾íte obsah schránky doprostøed zobrazené oblasti plátna. Stisknutím Ctrl-K vlo¾íte obsah schránky do místa, odkud byla zkopírována. Bìhem vkládání mohou být pou¾ity ¹ipky pro upøesnìní pozice pøed potvrzením operace. Escape pøeru¹í operaci vkládání a odstraní vkládací obdélník. Pokud máte ve volbách nastavené zobrazování my¹i jako nástroje, tak pohybem my¹í pøes vkládaný obdélník se kurzor zmìní na ètyøcestnou ¹ipku. Pokud bìhem této operace stisknete levé tlaèítko my¹i, tak budete schopni pøesunout vkládací obdélník. Pro potvrzení operace vlo¾ení stisknìte pravé tlaèítko my¹i, nebo klávesu Enter/Return. Stisknutím obou tlaèítek my¹i a posunováním, mù¾ete pou¾ít obrázek ze schránky jako ¹tìtec. Pokud upravujete obrázek s pomocí ochranné masky barev, nebudou tyto barvy na plátnì pøekresleny. Bìhem vkládání je mo¾né pou¾ít barevnou masku prùhlednosti pro vkládání neobdélníkových tvarù. Nejjednodu¹¹í cesta k pochopení je vyzkou¹ení následujícího pøíkladu: 1) Napi¹te "mtpaint src/graphics/testcard.png" 2) Stisknìte Ctrl-A, potom Ctrl-C a pak Ctrl-V. 3) Nyní jste schopni vkládat obsah schránky jako obyèejnì. 4) Jestli¾e nyní z menu vyberete "Výbìr -> Maskovat barvy A,B", zpùsobíte to, ¾e èervená a èerná barva budou ve schránce prùhledné. 5) Pro návrat do normálu vyberte "Výbìr -> Zru¹it Masku" 6) Dal¹í barvy mohou být maskovány na kumulativní bázi jejich výbìrem v paletì a opakovaným pou¾itím "Výbìr -> Maskovat barvy A,B". V oknì voleb je pøidaná mo¾nost výbìru, jestli chcete nezobrazovat obsah schránky bìhem pøesunování vkládacího obdélníku. Jinak øeèeno, jednodu¹e uvidíte pouze modro-bílý okraj, dokud nepotvrdíte operaci. Nástroj výbìru se pou¾ívá také pro mnoho dal¹ích kreslících funkcí. Ty se nacházejí v menu "Výbìr". Napøíklad mù¾ete aktuální výbìr vyplnit barvou, nebo nakreslit elipsu. Stejnì jako výbìr pomocí obdélníku, mù¾ete oznaèovat nástrojem výbìru polygonem a potom vyplòovat, dìlat okraje, kopírovat, vyjmout a vlo¾it. Po zvolení tohoto nástroje kliknìte levým tlaèítkem na plátno, kde chcete zahájit polygon. Potom mù¾ete podr¾et levé tlaèítko pro volné kreslení, nebo uvolnit pro dlouhou rovnou hranu. Pro ukonèení stisknìte pravé tlaèítko. Mù¾ete také vytvoøit polygon podr¾ením pravého tlaèítka a pøesunováním my¹i. V tomto pøípadì uvolnìní tlaèítka ukonèí polygon. Pomocí klávesy Escape zru¹íte výbìr. Jakmile je výbìr polygonem hotový, mù¾ete pou¾ít nástroj Laso pro zmen¹ení hran výbìru se stejnou barvou. Pokud máte napøíklad èerné pozadí s èerveným koleèkem, mù¾ete ho rukou nahrubo obkrou¾it a pak vybrat nástroj laso, který vytvoøí výbìr pouze èerveného koleèka bez èerných okrajù. pou¾itím menu Výbìru mù¾ete také 'vyjmout lasem' oblast, kterou vyplòuje lasem vybraná èást plátna.

source: mtPaint allows the user to store up to 12 images in a multiple image clipboard. This works by saving a PNG file containing each clipboard image and then using the Edit menu to load these images as required. To save image data to the clipboard try the following example: 1) Make a selection on the canvas 2) Copy the selection - Ctrl-C 3) Save this selection to clipboard 3 - Ctrl-F3 To load this clipboard image at any time simply press Shift-F3. The benefit of using a multiple image clipboard in this way is that it gives the user more flexibility. For example, you can have two independent mtPaint programs running and be able to load and save clipboard data between the two at the touch of a button. Also, as long as the files are not deleted you will have access to these clipboard images after closing and restarting mtPaint (or even rebooting the system). It is only possible to paste an RGB clipboard onto an RGB image and an Indexed Palette clipboard onto an Indexed Palette image. As the clipboard files are standard PNG files, the user can also open them in another mtPaint process and edit them. The clipboard files are stored in the location set in the Preferences window.
cs: mtPaint umo¾ní u¾ivateli ulo¾it a¾ 12 obrázkù do víceobrázkové schránky. Provede se to ulo¾ením PNG souboru obsahujícím obrázek ve schránce a následnì naètením tìchto obrázkù dle potøeby pomocí menu Upravit. Pro ulo¾ení obrázku do schránky zkuste následující pøíklad: 1) Proveïte výbìr oblasti na plátnì 2) Zkopírujte výbìr pomocí Ctrl-C 3) Ulo¾te tento výbìr do 3. schránky - Ctrl-F3 Pro naètení této schránky jednodu¹e kdykoliv stisknìte Shift-F3. Výhoda pou¾ívání více schránek s obrázky je v tom, ¾e dá u¾ivateli vìt¹í flexibilitu pøi práci. Napøíklad mù¾ete mít spu¹tìné dva nezávislé mtPainty najednou a mù¾ete mezi nimi bez problému naèítat a ukládat schránky pouze stisknutím jediného tlaèítka. Také díky tomu, ¾e soubory nejsou mazány, máte k tìmto obrázkùm pøístup po zavøení a znovuspu¹tìní mtPaintu (nebo pøi restartování systému). Je mo¾né vkládat pouze RGB schránku na RGB obrázek, popøípadì indexovanou schránku na indexovaný obrázek. Díky tomu, ¾e schránky jsou normální PNG soubory, mù¾e je u¾ivatel otevírat a upravovat v jiné instanci mtPaintu. Soubory schránky jsou ukládány do místa nastaveného v oknì voleb.
